/* automatically generated by rust-bindgen 0.72.1 */

#![allow(non_camel_case_types, non_snake_case, non_upper_case_globals)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {

pub const TOPO_SENSOR_STATE_GENERIC_PREDFAIL_ASSERTED: u32 = 2;
pub const TOPO_SENSOR_TYPE_GENERIC_LIMIT: u32 = 261;
pub const TOPO_SENSOR_STATE_GENERIC_LIMIT_NOT_EXCEEDED: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_LIMIT_EXCEEDED: u32 = 2;
pub const TOPO_SENSOR_TYPE_GENERIC_PERFORMANCE: u32 = 262;
pub const TOPO_SENSOR_STATE_GENERIC_PERFORMANCE_MET: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_PERFORMANCE_LAGS: u32 = 2;
pub const TOPO_SENSOR_TYPE_SEVERITY: u32 = 263;
pub const TOPO_SENSOR_STATE_SEVERITY_OK: u32 = 1;
pub const TOPO_SENSOR_STATE_SEVERITY_NONCRIT_GOING_HIGH: u32 = 2;
pub const TOPO_SENSOR_STATE_SEVERITY_CRIT_GOING_HIGH: u32 = 4;
pub const TOPO_SENSOR_STATE_SEVERITY_NONREC_GOING_HIGH: u32 = 8;
pub const TOPO_SENSOR_STATE_SEVERITY_NONCRIT_GOING_LOW: u32 = 16;
pub const TOPO_SENSOR_STATE_SEVERITY_CRIT_GOING_LOW: u32 = 32;
pub const TOPO_SENSOR_STATE_SEVERITY_NONREC_GOING_LOW: u32 = 32;
pub const TOPO_SENSOR_STATE_SEVERITY_MONITOR: u32 = 64;
pub const TOPO_SENSOR_STATE_SEVERITY_INFORMATIONAL: u32 = 128;
pub const TOPO_SENSOR_TYPE_GENERIC_PRESENCE: u32 = 264;
pub const TOPO_SENSOR_STATE_GENERIC_PRESENCE_DEASSERTED: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_PRESENCE_ASSERTED: u32 = 2;
pub const TOPO_SENSOR_TYPE_GENERIC_AVAILABILITY: u32 = 265;
pub const TOPO_SENSOR_STATE_GENERIC_AVAIL_DEASSERTED: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_AVAIL_ASSERTED: u32 = 2;
pub const TOPO_SENSOR_TYPE_GENERIC_STATUS: u32 = 266;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_RUNNING: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_IN_TEST: u32 = 2;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_POWER_OFF: u32 = 4;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_ONLINE: u32 = 8;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_OFFLINE: u32 = 16;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_OFF_DUTY: u32 = 32;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_DEGRADED: u32 = 64;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_POWER_SAVE: u32 = 128;
pub const TOPO_SENSOR_STATE_GENERIC_STATUS_INSTALL_ERR: u32 = 256;
pub const TOPO_SENSOR_TYPE_GENERIC_REDUNDANCY: u32 = 267;
pub const TOPO_SENSOR_TYPE_GENERIC_ACPI: u32 = 268;
pub const TOPO_SENSOR_STATE_GENERIC_ACPI_D0: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_ACPI_D1: u32 = 2;
pub const TOPO_SENSOR_STATE_GENERIC_ACPI_D2: u32 = 4;
pub const TOPO_SENSOR_STATE_GENERIC_ACPI_D3: u32 = 8;
pub const TOPO_SENSOR_TYPE_GENERIC_FAILURE: u32 = 269;
pub const TOPO_SENSOR_STATE_GENERIC_FAIL_DEASSERTED: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_FAIL_NONRECOV: u32 = 2;
pub const TOPO_SENSOR_STATE_GENERIC_FAIL_CRITICAL: u32 = 4;
pub const TOPO_SENSOR_TYPE_GENERIC_OK: u32 = 270;
pub const TOPO_SENSOR_STATE_GENERIC_OK_DEASSERTED: u32 = 1;
pub const TOPO_SENSOR_STATE_GENERIC_OK_ASSERTED: u32 = 2;
pub const TOPO_SENSOR_TYPE_SYNTHETIC: u32 = 271;
pub const TOPO_FAC_TYPE_ANY: u32 = 4294967295;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _label_t {
    pub val: [::std::os::raw::c_long; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _label_t"][::std::mem::size_of::<_label_t>() - 64usize];
    ["Alignment of _label_t"][::std::mem::align_of::<_label_t>() - 8usize];
    ["Offset of field: _label_t::val"][::std::mem::offset_of!(_label_t, val) - 0usize];
};
pub type label_t = _label_t;
pub type lock_t = ::std::os::raw::c_uchar;
pub type intmax_t = i64;
pub type uintmax_t = u64;
pub type int_fast8_t = ::std::os::raw::c_char;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type int_least8_t = ::std::os::raw::c_char;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type longlong_t = ::std::os::raw::c_longlong;
pub type u_longlong_t = ::std::os::raw::c_ulonglong;
pub type t_scalar_t = i32;
pub type t_uscalar_t = u32;
pub type uchar_t = ::std::os::raw::c_uchar;
pub type ushort_t = ::std::os::raw::c_ushort;
pub type uint_t = ::std::os::raw::c_uint;
pub type ulong_t = ::std::os::raw::c_ulong;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type daddr_t = ::std::os::raw::c_long;
pub type cnt_t = ::std::os::raw::c_short;
pub type pfn_t = ulong_t;
pub type pgcnt_t = ulong_t;
pub type spgcnt_t = ::std::os::raw::c_long;
pub type use_t = uchar_t;
pub type sysid_t = ::std::os::raw::c_short;
pub type index_t = ::std::os::raw::c_short;
pub type timeout_id_t = *mut ::std::os::raw::c_void;
pub type bufcall_id_t = *mut ::std::os::raw::c_void;
pub type off_t = ::std::os::raw::c_long;
pub type off64_t = off_t;
pub type ino_t = ulong_t;
pub type blkcnt_t = ::std::os::raw::c_long;
pub type fsblkcnt_t = ulong_t;
pub type fsfilcnt_t = ulong_t;
pub type ino64_t = ino_t;
pub type blkcnt64_t = blkcnt_t;
pub type fsblkcnt64_t = fsblkcnt_t;
pub type fsfilcnt64_t = fsfilcnt_t;
pub type blksize_t = ::std::os::raw::c_int;
pub const boolean_t_B_FALSE: boolean_t = 0;
pub const boolean_t_B_TRUE: boolean_t = 1;
pub const boolean_t__B_FALSE: boolean_t = 0;
pub const boolean_t__B_TRUE: boolean_t = 1;
pub type boolean_t = ::std::os::raw::c_uint;
pub type pad64_t = i64;
pub type upad64_t = u64;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union pad128_t {
    pub _q: u128,
    pub _l: [i32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pad128_t"][::std::mem::size_of::<pad128_t>() - 16usize];
    ["Alignment of pad128_t"][::std::mem::align_of::<pad128_t>() - 16usize];
    ["Offset of field: pad128_t::_q"][::std::mem::offset_of!(pad128_t, _q) - 0usize];
    ["Offset of field: pad128_t::_l"][::std::mem::offset_of!(pad128_t, _l) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union upad128_t {
    pub _q: u128,
    pub _l: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of upad128_t"][::std::mem::size_of::<upad128_t>() - 16usize];
    ["Alignment of upad128_t"][::std::mem::align_of::<upad128_t>() - 16usize];
    ["Offset of field: upad128_t::_q"][::std::mem::offset_of!(upad128_t, _q) - 0usize];
    ["Offset of field: upad128_t::_l"][::std::mem::offset_of!(upad128_t, _l) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union upad256_t {
    pub _q: [u128; 2usize],
    pub _l: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of upad256_t"][::std::mem::size_of::<upad256_t>() - 32usize];
    ["Alignment of upad256_t"][::std::mem::align_of::<upad256_t>() - 16usize];
    ["Offset of field: upad256_t::_q"][::std::mem::offset_of!(upad256_t, _q) - 0usize];
    ["Offset of field: upad256_t::_l"][::std::mem::offset_of!(upad256_t, _l) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union upad512_t {
    pub _q: [u128; 4usize],
    pub _l: [u32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of upad512_t"][::std::mem::size_of::<upad512_t>() - 64usize];
    ["Alignment of upad512_t"][::std::mem::align_of::<upad512_t>() - 16usize];
    ["Offset of field: upad512_t::_q"][::std::mem::offset_of!(upad512_t, _q) - 0usize];
    ["Offset of field: upad512_t::_l"][::std::mem::offset_of!(upad512_t, _l) - 0usize];
};
pub type offset_t = longlong_t;
pub type u_offset_t = u_longlong_t;
pub type len_t = u_longlong_t;
pub type diskaddr_t = u_longlong_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union lloff_t {
    pub _f: offset_t,
    pub _p: lloff_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lloff_t__bindgen_ty_1 {
    pub _l: i32,
    pub _u: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lloff_t__bindgen_ty_1"][::std::mem::size_of::<lloff_t__bindgen_ty_1>() - 8usize];
    ["Alignment of lloff_t__bindgen_ty_1"]
        [::std::mem::align_of::<lloff_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: lloff_t__bindgen_ty_1::_l"]
        [::std::mem::offset_of!(lloff_t__bindgen_ty_1, _l) - 0usize];
    ["Offset of field: lloff_t__bindgen_ty_1::_u"]
        [::std::mem::offset_of!(lloff_t__bindgen_ty_1, _u) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lloff_t"][::std::mem::size_of::<lloff_t>() - 8usize];
    ["Alignment of lloff_t"][::std::mem::align_of::<lloff_t>() - 8usize];
    ["Offset of field: lloff_t::_f"][::std::mem::offset_of!(lloff_t, _f) - 0usize];
    ["Offset of field: lloff_t::_p"][::std::mem::offset_of!(lloff_t, _p) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union lldaddr_t {
    pub _f: longlong_t,
    pub _p: lldaddr_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldaddr_t__bindgen_ty_1 {
    pub _l: i32,
    pub _u: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldaddr_t__bindgen_ty_1"][::std::mem::size_of::<lldaddr_t__bindgen_ty_1>() - 8usize];
    ["Alignment of lldaddr_t__bindgen_ty_1"]
        [::std::mem::align_of::<lldaddr_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: lldaddr_t__bindgen_ty_1::_l"]
        [::std::mem::offset_of!(lldaddr_t__bindgen_ty_1, _l) - 0usize];
    ["Offset of field: lldaddr_t__bindgen_ty_1::_u"]
        [::std::mem::offset_of!(lldaddr_t__bindgen_ty_1, _u) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldaddr_t"][::std::mem::size_of::<lldaddr_t>() - 8usize];
    ["Alignment of lldaddr_t"][::std::mem::align_of::<lldaddr_t>() - 8usize];
    ["Offset of field: lldaddr_t::_f"][::std::mem::offset_of!(lldaddr_t, _f) - 0usize];
    ["Offset of field: lldaddr_t::_p"][::std::mem::offset_of!(lldaddr_t, _p) - 0usize];
};
pub type k_fltset_t = uint_t;
pub type id_t = ::std::os::raw::c_int;
pub type lgrp_id_t = id_t;
pub type useconds_t = uint_t;
pub type suseconds_t = ::std::os::raw::c_long;
pub type major_t = uint_t;
pub type minor_t = uint_t;
pub type pri_t = ::std::os::raw::c_short;
pub type cpu_flag_t = ushort_t;
pub type o_mode_t = ushort_t;
pub type o_dev_t = ::std::os::raw::c_short;
pub type o_uid_t = ushort_t;
pub type o_gid_t = o_uid_t;
pub type o_nlink_t = ::std::os::raw::c_short;
pub type o_pid_t = ::std::os::raw::c_short;
pub type o_ino_t = ushort_t;
pub type key_t = ::std::os::raw::c_int;
pub type mode_t = uint_t;
pub type uid_t = ::std::os::raw::c_uint;
pub type gid_t = uid_t;
pub type datalink_id_t = u32;
pub type vrid_t = u32;
pub type taskid_t = id_t;
pub type projid_t = id_t;
pub type poolid_t = id_t;
pub type zoneid_t = id_t;
pub type ctid_t = id_t;
pub type pthread_t = uint_t;
pub type pthread_key_t = uint_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _pthread_mutex {
    pub __pthread_mutex_flags: _pthread_mutex__bindgen_ty_1,
    pub __pthread_mutex_lock: _pthread_mutex__bindgen_ty_2,
    pub __pthread_mutex_data: upad64_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_mutex__bindgen_ty_1 {
    pub __pthread_mutex_flag1: u16,
    pub __pthread_mutex_flag2: u8,
    pub __pthread_mutex_ceiling: u8,
    pub __pthread_mutex_type: u16,
    pub __pthread_mutex_magic: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_mutex__bindgen_ty_1"]
        [::std::mem::size_of::<_pthread_mutex__bindgen_ty_1>() - 8usize];
    ["Alignment of _pthread_mutex__bindgen_ty_1"]
        [::std::mem::align_of::<_pthread_mutex__bindgen_ty_1>() - 2usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_1::__pthread_mutex_flag1"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_1, __pthread_mutex_flag1) - 0usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_1::__pthread_mutex_flag2"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_1, __pthread_mutex_flag2) - 2usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_1::__pthread_mutex_ceiling"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_1, __pthread_mutex_ceiling) - 3usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_1::__pthread_mutex_type"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_1, __pthread_mutex_type) - 4usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_1::__pthread_mutex_magic"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_1, __pthread_mutex_magic) - 6usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _pthread_mutex__bindgen_ty_2 {
    pub __pthread_mutex_lock64: _pthread_mutex__bindgen_ty_2__bindgen_ty_1,
    pub __pthread_mutex_lock32: _pthread_mutex__bindgen_ty_2__bindgen_ty_2,
    pub __pthread_mutex_owner64: upad64_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_mutex__bindgen_ty_2__bindgen_ty_1 {
    pub __pthread_mutex_pad: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_mutex__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<_pthread_mutex__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of _pthread_mutex__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<_pthread_mutex__bindgen_ty_2__bindgen_ty_1>() - 1usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_2__bindgen_ty_1::__pthread_mutex_pad"][::std::mem::offset_of!(
        _pthread_mutex__bindgen_ty_2__bindgen_ty_1,
        __pthread_mutex_pad
    )
        - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_mutex__bindgen_ty_2__bindgen_ty_2 {
    pub __pthread_ownerpid: u32,
    pub __pthread_lockword: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_mutex__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::size_of::<_pthread_mutex__bindgen_ty_2__bindgen_ty_2>() - 8usize];
    ["Alignment of _pthread_mutex__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::align_of::<_pthread_mutex__bindgen_ty_2__bindgen_ty_2>() - 4usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_2__bindgen_ty_2::__pthread_ownerpid"][::std::mem::offset_of!(
        _pthread_mutex__bindgen_ty_2__bindgen_ty_2,
        __pthread_ownerpid
    ) - 0usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_2__bindgen_ty_2::__pthread_lockword"][::std::mem::offset_of!(
        _pthread_mutex__bindgen_ty_2__bindgen_ty_2,
        __pthread_lockword
    ) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_mutex__bindgen_ty_2"]
        [::std::mem::size_of::<_pthread_mutex__bindgen_ty_2>() - 8usize];
    ["Alignment of _pthread_mutex__bindgen_ty_2"]
        [::std::mem::align_of::<_pthread_mutex__bindgen_ty_2>() - 8usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_2::__pthread_mutex_lock64"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_2, __pthread_mutex_lock64) - 0usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_2::__pthread_mutex_lock32"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_2, __pthread_mutex_lock32) - 0usize];
    ["Offset of field: _pthread_mutex__bindgen_ty_2::__pthread_mutex_owner64"]
        [::std::mem::offset_of!(_pthread_mutex__bindgen_ty_2, __pthread_mutex_owner64) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_mutex"][::std::mem::size_of::<_pthread_mutex>() - 24usize];
    ["Alignment of _pthread_mutex"][::std::mem::align_of::<_pthread_mutex>() - 8usize];
    ["Offset of field: _pthread_mutex::__pthread_mutex_flags"]
        [::std::mem::offset_of!(_pthread_mutex, __pthread_mutex_flags) - 0usize];
    ["Offset of field: _pthread_mutex::__pthread_mutex_lock"]
        [::std::mem::offset_of!(_pthread_mutex, __pthread_mutex_lock) - 8usize];
    ["Offset of field: _pthread_mutex::__pthread_mutex_data"]
        [::std::mem::offset_of!(_pthread_mutex, __pthread_mutex_data) - 16usize];
};
pub type pthread_mutex_t = _pthread_mutex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cond {
    pub __pthread_cond_flags: _pthread_cond__bindgen_ty_1,
    pub __pthread_cond_data: upad64_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cond__bindgen_ty_1 {
    pub __pthread_cond_flag: [u8; 4usize],
    pub __pthread_cond_type: u16,
    pub __pthread_cond_magic: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_cond__bindgen_ty_1"]
        [::std::mem::size_of::<_pthread_cond__bindgen_ty_1>() - 8usize];
    ["Alignment of _pthread_cond__bindgen_ty_1"]
        [::std::mem::align_of::<_pthread_cond__bindgen_ty_1>() - 2usize];
    ["Offset of field: _pthread_cond__bindgen_ty_1::__pthread_cond_flag"]
        [::std::mem::offset_of!(_pthread_cond__bindgen_ty_1, __pthread_cond_flag) - 0usize];
    ["Offset of field: _pthread_cond__bindgen_ty_1::__pthread_cond_type"]
        [::std::mem::offset_of!(_pthread_cond__bindgen_ty_1, __pthread_cond_type) - 4usize];
    ["Offset of field: _pthread_cond__bindgen_ty_1::__pthread_cond_magic"]
        [::std::mem::offset_of!(_pthread_cond__bindgen_ty_1, __pthread_cond_magic) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_cond"][::std::mem::size_of::<_pthread_cond>() - 16usize];
    ["Alignment of _pthread_cond"][::std::mem::align_of::<_pthread_cond>() - 8usize];
    ["Offset of field: _pthread_cond::__pthread_cond_flags"]
        [::std::mem::offset_of!(_pthread_cond, __pthread_cond_flags) - 0usize];
    ["Offset of field: _pthread_cond::__pthread_cond_data"]
        [::std::mem::offset_of!(_pthread_cond, __pthread_cond_data) - 8usize];
};
pub type pthread_cond_t = _pthread_cond;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _pthread_rwlock {
    pub __pthread_rwlock_readers: i32,
    pub __pthread_rwlock_type: u16,
    pub __pthread_rwlock_magic: u16,
    pub __pthread_rwlock_mutex: pthread_mutex_t,
    pub __pthread_rwlock_readercv: pthread_cond_t,
    pub __pthread_rwlock_writercv: pthread_cond_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_rwlock"][::std::mem::size_of::<_pthread_rwlock>() - 64usize];
    ["Alignment of _pthread_rwlock"][::std::mem::align_of::<_pthread_rwlock>() - 8usize];
    ["Offset of field: _pthread_rwlock::__pthread_rwlock_readers"]
        [::std::mem::offset_of!(_pthread_rwlock, __pthread_rwlock_readers) - 0usize];
    ["Offset of field: _pthread_rwlock::__pthread_rwlock_type"]
        [::std::mem::offset_of!(_pthread_rwlock, __pthread_rwlock_type) - 4usize];
    ["Offset of field: _pthread_rwlock::__pthread_rwlock_magic"]
        [::std::mem::offset_of!(_pthread_rwlock, __pthread_rwlock_magic) - 6usize];
    ["Offset of field: _pthread_rwlock::__pthread_rwlock_mutex"]
        [::std::mem::offset_of!(_pthread_rwlock, __pthread_rwlock_mutex) - 8usize];
    ["Offset of field: _pthread_rwlock::__pthread_rwlock_readercv"]
        [::std::mem::offset_of!(_pthread_rwlock, __pthread_rwlock_readercv) - 32usize];
    ["Offset of field: _pthread_rwlock::__pthread_rwlock_writercv"]
        [::std::mem::offset_of!(_pthread_rwlock, __pthread_rwlock_writercv) - 48usize];
};
pub type pthread_rwlock_t = _pthread_rwlock;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_barrier_t {
    pub __pthread_barrier_count: u32,
    pub __pthread_barrier_current: u32,
    pub __pthread_barrier_cycle: upad64_t,
    pub __pthread_barrier_reserved: upad64_t,
    pub __pthread_barrier_lock: pthread_mutex_t,
    pub __pthread_barrier_cond: pthread_cond_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 64usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__pthread_barrier_count"]
        [::std::mem::offset_of!(pthread_barrier_t, __pthread_barrier_count) - 0usize];
    ["Offset of field: pthread_barrier_t::__pthread_barrier_current"]
        [::std::mem::offset_of!(pthread_barrier_t, __pthread_barrier_current) - 4usize];
    ["Offset of field: pthread_barrier_t::__pthread_barrier_cycle"]
        [::std::mem::offset_of!(pthread_barrier_t, __pthread_barrier_cycle) - 8usize];
    ["Offset of field: pthread_barrier_t::__pthread_barrier_reserved"]
        [::std::mem::offset_of!(pthread_barrier_t, __pthread_barrier_reserved) - 16usize];
    ["Offset of field: pthread_barrier_t::__pthread_barrier_lock"]
        [::std::mem::offset_of!(pthread_barrier_t, __pthread_barrier_lock) - 24usize];
    ["Offset of field: pthread_barrier_t::__pthread_barrier_cond"]
        [::std::mem::offset_of!(pthread_barrier_t, __pthread_barrier_cond) - 48usize];
};
pub type pthread_spinlock_t = pthread_mutex_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_attr {
    pub __pthread_attrp: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_attr"][::std::mem::size_of::<_pthread_attr>() - 8usize];
    ["Alignment of _pthread_attr"][::std::mem::align_of::<_pthread_attr>() - 8usize];
    ["Offset of field: _pthread_attr::__pthread_attrp"]
        [::std::mem::offset_of!(_pthread_attr, __pthread_attrp) - 0usize];
};
pub type pthread_attr_t = _pthread_attr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_mutexattr {
    pub __pthread_mutexattrp: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_mutexattr"][::std::mem::size_of::<_pthread_mutexattr>() - 8usize];
    ["Alignment of _pthread_mutexattr"][::std::mem::align_of::<_pthread_mutexattr>() - 8usize];
    ["Offset of field: _pthread_mutexattr::__pthread_mutexattrp"]
        [::std::mem::offset_of!(_pthread_mutexattr, __pthread_mutexattrp) - 0usize];
};
pub type pthread_mutexattr_t = _pthread_mutexattr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_condattr {
    pub __pthread_condattrp: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_condattr"][::std::mem::size_of::<_pthread_condattr>() - 8usize];
    ["Alignment of _pthread_condattr"][::std::mem::align_of::<_pthread_condattr>() - 8usize];
    ["Offset of field: _pthread_condattr::__pthread_condattrp"]
        [::std::mem::offset_of!(_pthread_condattr, __pthread_condattrp) - 0usize];
};
pub type pthread_condattr_t = _pthread_condattr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _once {
    pub __pthread_once_pad: [upad64_t; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _once"][::std::mem::size_of::<_once>() - 32usize];
    ["Alignment of _once"][::std::mem::align_of::<_once>() - 8usize];
    ["Offset of field: _once::__pthread_once_pad"]
        [::std::mem::offset_of!(_once, __pthread_once_pad) - 0usize];
};
pub type pthread_once_t = _once;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_rwlockattr {
    pub __pthread_rwlockattrp: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_rwlockattr"][::std::mem::size_of::<_pthread_rwlockattr>() - 8usize];
    ["Alignment of _pthread_rwlockattr"][::std::mem::align_of::<_pthread_rwlockattr>() - 8usize];
    ["Offset of field: _pthread_rwlockattr::__pthread_rwlockattrp"]
        [::std::mem::offset_of!(_pthread_rwlockattr, __pthread_rwlockattrp) - 0usize];
};
pub type pthread_rwlockattr_t = _pthread_rwlockattr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrierattr_t {
    pub __pthread_barrierattrp: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 8usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 8usize];
    ["Offset of field: pthread_barrierattr_t::__pthread_barrierattrp"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __pthread_barrierattrp) - 0usize];
};
pub type dev_t = ulong_t;
pub type nlink_t = uint_t;
pub type pid_t = ::std::os::raw::c_int;
pub type time_t = ::std::os::raw::c_long;
pub type clock_t = ::std::os::raw::c_long;
pub type clockid_t = ::std::os::raw::c_int;
pub type timer_t = ::std::os::raw::c_int;
pub type unchar = ::std::os::raw::c_uchar;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type ulong = ::std::os::raw::c_ulong;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _quad {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _quad"][::std::mem::size_of::<_quad>() - 8usize];
    ["Alignment of _quad"][::std::mem::align_of::<_quad>() - 4usize];
    ["Offset of field: _quad::val"][::std::mem::offset_of!(_quad, val) - 0usize];
};
pub type quad_t = _quad;
pub type quad = quad_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type timespec_t = timespec;
pub type timestruc_t = timespec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
pub type itimerspec_t = itimerspec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::std::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::std::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::std::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::std::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::std::mem::size_of::<itimerval>() - 32usize];
    ["Alignment of itimerval"][::std::mem::align_of::<itimerval>() - 8usize];
    ["Offset of field: itimerval::it_interval"]
        [::std::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"][::std::mem::offset_of!(itimerval, it_value) - 16usize];
};
pub type hrtime_t = longlong_t;
unsafe extern "C" {
    pub fn adjtime(arg1: *const timeval, arg2: *mut timeval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimesat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getitimer(arg1: ::std::os::raw::c_int, arg2: *mut itimerval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn utimes(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setitimer(
        arg1: ::std::os::raw::c_int,
        arg2: *mut itimerval,
        arg3: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn futimes(arg1: ::std::os::raw::c_int, arg2: *const timeval) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lutimes(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn settimeofday(
        arg1: *mut timeval,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gethrtime() -> hrtime_t;
}
unsafe extern "C" {
    pub fn gethrvtime() -> hrtime_t;
}
unsafe extern "C" {
    pub fn gettimeofday(
        arg1: *mut timeval,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 36usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 4usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
};
unsafe extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
unsafe extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn strptime(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_notify: ::std::os::raw::c_int,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_value: sigval,
    pub sigev_notify_function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval)>,
    pub sigev_notify_attributes: *mut pthread_attr_t,
    pub __sigev_pad2: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigevent"][::std::mem::size_of::<sigevent>() - 40usize];
    ["Alignment of sigevent"][::std::mem::align_of::<sigevent>() - 8usize];
    ["Offset of field: sigevent::sigev_notify"]
        [::std::mem::offset_of!(sigevent, sigev_notify) - 0usize];
    ["Offset of field: sigevent::sigev_signo"]
        [::std::mem::offset_of!(sigevent, sigev_signo) - 4usize];
    ["Offset of field: sigevent::sigev_value"]
        [::std::mem::offset_of!(sigevent, sigev_value) - 8usize];
    ["Offset of field: sigevent::sigev_notify_function"]
        [::std::mem::offset_of!(sigevent, sigev_notify_function) - 16usize];
    ["Offset of field: sigevent::sigev_notify_attributes"]
        [::std::mem::offset_of!(sigevent, sigev_notify_attributes) - 24usize];
    ["Offset of field: sigevent::__sigev_pad2"]
        [::std::mem::offset_of!(sigevent, __sigev_pad2) - 32usize];
};
unsafe extern "C" {
    pub fn clock_getres(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(arg1: clockid_t, arg2: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        arg1: clockid_t,
        arg2: *mut sigevent,
        arg3: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(arg1: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(arg1: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(arg1: timer_t, arg2: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        arg1: timer_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const itimerspec,
        arg4: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(arg1: *const timespec, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        arg1: clockid_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const timespec,
        arg4: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn _sysconf(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn cftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *const time_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ascftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const tm,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut altzone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn getdate(arg1: *const ::std::os::raw::c_char) -> *mut tm;
}
unsafe extern "C" {
    pub static mut getdate_err: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asctime_r(
        arg1: *const tm,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        arg1: *const time_t,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _locale {
    _unused: [u8; 0],
}
pub type locale_t = *mut _locale;
unsafe extern "C" {
    pub fn strftime_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
        arg5: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn timespec_get(arg1: *mut timespec, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_getres(
        arg1: *mut timespec,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigset_t {
    pub __sigbits: [::std::os::raw::c_uint; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigset_t"][::std::mem::size_of::<sigset_t>() - 16usize];
    ["Alignment of sigset_t"][::std::mem::align_of::<sigset_t>() - 4usize];
    ["Offset of field: sigset_t::__sigbits"][::std::mem::offset_of!(sigset_t, __sigbits) - 0usize];
};
pub type fd_mask = ::std::os::raw::c_long;
pub type fds_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [::std::os::raw::c_long; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 8192usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::fds_bits"][::std::mem::offset_of!(fd_set, fds_bits) - 0usize];
};
unsafe extern "C" {
    pub fn _memset(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn select(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *const timespec,
        arg6: *const sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type __va_list = __builtin_va_list;
pub const data_type_t_DATA_TYPE_DONTCARE: data_type_t = -1;
pub const data_type_t_DATA_TYPE_UNKNOWN: data_type_t = 0;
pub const data_type_t_DATA_TYPE_BOOLEAN: data_type_t = 1;
pub const data_type_t_DATA_TYPE_BYTE: data_type_t = 2;
pub const data_type_t_DATA_TYPE_INT16: data_type_t = 3;
pub const data_type_t_DATA_TYPE_UINT16: data_type_t = 4;
pub const data_type_t_DATA_TYPE_INT32: data_type_t = 5;
pub const data_type_t_DATA_TYPE_UINT32: data_type_t = 6;
pub const data_type_t_DATA_TYPE_INT64: data_type_t = 7;
pub const data_type_t_DATA_TYPE_UINT64: data_type_t = 8;
pub const data_type_t_DATA_TYPE_STRING: data_type_t = 9;
pub const data_type_t_DATA_TYPE_BYTE_ARRAY: data_type_t = 10;
pub const data_type_t_DATA_TYPE_INT16_ARRAY: data_type_t = 11;
pub const data_type_t_DATA_TYPE_UINT16_ARRAY: data_type_t = 12;
pub const data_type_t_DATA_TYPE_INT32_ARRAY: data_type_t = 13;
pub const data_type_t_DATA_TYPE_UINT32_ARRAY: data_type_t = 14;
pub const data_type_t_DATA_TYPE_INT64_ARRAY: data_type_t = 15;
pub const data_type_t_DATA_TYPE_UINT64_ARRAY: data_type_t = 16;
pub const data_type_t_DATA_TYPE_STRING_ARRAY: data_type_t = 17;
pub const data_type_t_DATA_TYPE_HRTIME: data_type_t = 18;
pub const data_type_t_DATA_TYPE_NVLIST: data_type_t = 19;
pub const data_type_t_DATA_TYPE_NVLIST_ARRAY: data_type_t = 20;
pub const data_type_t_DATA_TYPE_BOOLEAN_VALUE: data_type_t = 21;
pub const data_type_t_DATA_TYPE_INT8: data_type_t = 22;
pub const data_type_t_DATA_TYPE_UINT8: data_type_t = 23;
pub const data_type_t_DATA_TYPE_BOOLEAN_ARRAY: data_type_t = 24;
pub const data_type_t_DATA_TYPE_INT8_ARRAY: data_type_t = 25;
pub const data_type_t_DATA_TYPE_UINT8_ARRAY: data_type_t = 26;
pub const data_type_t_DATA_TYPE_DOUBLE: data_type_t = 27;
pub type data_type_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvpair {
    pub nvp_size: i32,
    pub nvp_name_sz: i16,
    pub nvp_reserve: i16,
    pub nvp_value_elem: i32,
    pub nvp_type: data_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nvpair"][::std::mem::size_of::<nvpair>() - 16usize];
    ["Alignment of nvpair"][::std::mem::align_of::<nvpair>() - 4usize];
    ["Offset of field: nvpair::nvp_size"][::std::mem::offset_of!(nvpair, nvp_size) - 0usize];
    ["Offset of field: nvpair::nvp_name_sz"][::std::mem::offset_of!(nvpair, nvp_name_sz) - 4usize];
    ["Offset of field: nvpair::nvp_reserve"][::std::mem::offset_of!(nvpair, nvp_reserve) - 6usize];
    ["Offset of field: nvpair::nvp_value_elem"]
        [::std::mem::offset_of!(nvpair, nvp_value_elem) - 8usize];
    ["Offset of field: nvpair::nvp_type"][::std::mem::offset_of!(nvpair, nvp_type) - 12usize];
};
pub type nvpair_t = nvpair;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvlist {
    pub nvl_version: i32,
    pub nvl_nvflag: u32,
    pub nvl_priv: u64,
    pub nvl_flag: u32,
    pub nvl_pad: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nvlist"][::std::mem::size_of::<nvlist>() - 24usize];
    ["Alignment of nvlist"][::std::mem::align_of::<nvlist>() - 8usize];
    ["Offset of field: nvlist::nvl_version"][::std::mem::offset_of!(nvlist, nvl_version) - 0usize];
    ["Offset of field: nvlist::nvl_nvflag"][::std::mem::offset_of!(nvlist, nvl_nvflag) - 4usize];
    ["Offset of field: nvlist::nvl_priv"][::std::mem::offset_of!(nvlist, nvl_priv) - 8usize];
    ["Offset of field: nvlist::nvl_flag"][::std::mem::offset_of!(nvlist, nvl_flag) - 16usize];
    ["Offset of field: nvlist::nvl_pad"][::std::mem::offset_of!(nvlist, nvl_pad) - 20usize];
};
pub type nvlist_t = nvlist;
pub type nv_alloc_ops_t = nv_alloc_ops;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nv_alloc {
    pub nva_ops: *const nv_alloc_ops_t,
    pub nva_arg: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nv_alloc"][::std::mem::size_of::<nv_alloc>() - 16usize];
    ["Alignment of nv_alloc"][::std::mem::align_of::<nv_alloc>() - 8usize];
    ["Offset of field: nv_alloc::nva_ops"][::std::mem::offset_of!(nv_alloc, nva_ops) - 0usize];
    ["Offset of field: nv_alloc::nva_arg"][::std::mem::offset_of!(nv_alloc, nva_arg) - 8usize];
};
pub type nv_alloc_t = nv_alloc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nv_alloc_ops {
    pub nv_ao_init: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut nv_alloc_t,
            arg2: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int,
    >,
    pub nv_ao_fini: ::std::option::Option<unsafe extern "C" fn(arg1: *mut nv_alloc_t)>,
    pub nv_ao_alloc: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut nv_alloc_t, arg2: usize) -> *mut ::std::os::raw::c_void,
    >,
    pub nv_ao_free: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut nv_alloc_t, arg2: *mut ::std::os::raw::c_void, arg3: usize),
    >,
    pub nv_ao_reset: ::std::option::Option<unsafe extern "C" fn(arg1: *mut nv_alloc_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nv_alloc_ops"][::std::mem::size_of::<nv_alloc_ops>() - 40usize];
    ["Alignment of nv_alloc_ops"][::std::mem::align_of::<nv_alloc_ops>() - 8usize];
    ["Offset of field: nv_alloc_ops::nv_ao_init"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_init) - 0usize];
    ["Offset of field: nv_alloc_ops::nv_ao_fini"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_fini) - 8usize];
    ["Offset of field: nv_alloc_ops::nv_ao_alloc"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_alloc) - 16usize];
    ["Offset of field: nv_alloc_ops::nv_ao_free"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_free) - 24usize];
    ["Offset of field: nv_alloc_ops::nv_ao_reset"]
        [::std::mem::offset_of!(nv_alloc_ops, nv_ao_reset) - 32usize];
};
unsafe extern "C" {
    pub static mut nv_fixed_ops: *const nv_alloc_ops_t;
}
unsafe extern "C" {
    pub static mut nv_alloc_nosleep: *mut nv_alloc_t;
}
unsafe extern "C" {
    pub fn nv_alloc_init(
        arg1: *mut nv_alloc_t,
        arg2: *const nv_alloc_ops_t,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nv_alloc_reset(arg1: *mut nv_alloc_t);
}
unsafe extern "C" {
    pub fn nv_alloc_fini(arg1: *mut nv_alloc_t);
}
unsafe extern "C" {
    pub fn nvlist_alloc(
        arg1: *mut *mut nvlist_t,
        arg2: uint_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_free(arg1: *mut nvlist_t);
}
unsafe extern "C" {
    pub fn nvlist_size(
        arg1: *mut nvlist_t,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_pack(
        arg1: *mut nvlist_t,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_unpack(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *mut *mut nvlist_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_dup(
        arg1: *mut nvlist_t,
        arg2: *mut *mut nvlist_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_merge(
        arg1: *mut nvlist_t,
        arg2: *mut nvlist_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_nvflag(arg1: *mut nvlist_t) -> uint_t;
}
unsafe extern "C" {
    pub fn nvlist_xalloc(
        arg1: *mut *mut nvlist_t,
        arg2: uint_t,
        arg3: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_xpack(
        arg1: *mut nvlist_t,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut usize,
        arg4: ::std::os::raw::c_int,
        arg5: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_xunpack(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *mut *mut nvlist_t,
        arg4: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_xdup(
        arg1: *mut nvlist_t,
        arg2: *mut *mut nvlist_t,
        arg3: *mut nv_alloc_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nv_alloc(arg1: *mut nvlist_t) -> *mut nv_alloc_t;
}
unsafe extern "C" {
    pub fn nvlist_add_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_boolean(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_boolean_value(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_byte(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: uchar_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_string(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_nvlist(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut nvlist_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_boolean_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut boolean_t,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_byte_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut uchar_t,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i8,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u8,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i16,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u16,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i32,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u32,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_int64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i64,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_uint64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u64,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_string_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const *mut ::std::os::raw::c_char,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_nvlist_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvlist_t,
        arg4: uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_hrtime(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: hrtime_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_add_double(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_remove(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: data_type_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_remove_all(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_remove_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_boolean(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_boolean_value(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_byte(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut uchar_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint8(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u8,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint16(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint32(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint64(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_string(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvlist(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvlist_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_boolean_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut boolean_t,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_byte_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut uchar_t,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i8,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u8,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i16,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u16,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i32,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u32,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_int64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut i64,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_uint64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut u64,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_string_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut *mut ::std::os::raw::c_char,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvlist_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut *mut nvlist_t,
        arg4: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_hrtime(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut hrtime_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_pairs(
        arg1: *mut nvlist_t,
        arg2: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_double(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvpair(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvpair_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_lookup_nvpair_embedded_index(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvpair_t,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_exists(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char) -> boolean_t;
}
unsafe extern "C" {
    pub fn nvlist_empty(arg1: *mut nvlist_t) -> boolean_t;
}
unsafe extern "C" {
    pub fn nvlist_next_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> *mut nvpair_t;
}
unsafe extern "C" {
    pub fn nvlist_prev_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t) -> *mut nvpair_t;
}
unsafe extern "C" {
    pub fn nvpair_name(arg1: *mut nvpair_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn nvpair_type(arg1: *mut nvpair_t) -> data_type_t;
}
unsafe extern "C" {
    pub fn nvpair_type_is_array(arg1: *mut nvpair_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_boolean_value(
        arg1: *mut nvpair_t,
        arg2: *mut boolean_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_byte(arg1: *mut nvpair_t, arg2: *mut uchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int8(arg1: *mut nvpair_t, arg2: *mut i8) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint8(arg1: *mut nvpair_t, arg2: *mut u8) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int16(arg1: *mut nvpair_t, arg2: *mut i16) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint16(arg1: *mut nvpair_t, arg2: *mut u16) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int32(arg1: *mut nvpair_t, arg2: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint32(arg1: *mut nvpair_t, arg2: *mut u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int64(arg1: *mut nvpair_t, arg2: *mut i64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint64(arg1: *mut nvpair_t, arg2: *mut u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_string(
        arg1: *mut nvpair_t,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_nvlist(
        arg1: *mut nvpair_t,
        arg2: *mut *mut nvlist_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_boolean_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut boolean_t,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_byte_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut uchar_t,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int8_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i8,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint8_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u8,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int16_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i16,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint16_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u16,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int32_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i32,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint32_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u32,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_int64_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut i64,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_uint64_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut u64,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_string_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut *mut ::std::os::raw::c_char,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_nvlist_array(
        arg1: *mut nvpair_t,
        arg2: *mut *mut *mut nvlist_t,
        arg3: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_hrtime(arg1: *mut nvpair_t, arg2: *mut hrtime_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_double(arg1: *mut nvpair_t, arg2: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fnvlist_alloc() -> *mut nvlist_t;
}
unsafe extern "C" {
    pub fn fnvlist_free(arg1: *mut nvlist_t);
}
unsafe extern "C" {
    pub fn fnvlist_size(arg1: *mut nvlist_t) -> usize;
}
unsafe extern "C" {
    pub fn fnvlist_pack(arg1: *mut nvlist_t, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fnvlist_pack_free(arg1: *mut ::std::os::raw::c_char, arg2: usize);
}
unsafe extern "C" {
    pub fn fnvlist_unpack(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> *mut nvlist_t;
}
unsafe extern "C" {
    pub fn fnvlist_dup(arg1: *mut nvlist_t) -> *mut nvlist_t;
}
unsafe extern "C" {
    pub fn fnvlist_merge(arg1: *mut nvlist_t, arg2: *mut nvlist_t);
}
unsafe extern "C" {
    pub fn fnvlist_num_pairs(arg1: *mut nvlist_t) -> usize;
}
unsafe extern "C" {
    pub fn fnvlist_add_boolean(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fnvlist_add_boolean_value(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: boolean_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_byte(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: uchar_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_int8(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: i8);
}
unsafe extern "C" {
    pub fn fnvlist_add_uint8(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: u8);
}
unsafe extern "C" {
    pub fn fnvlist_add_int16(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: i16);
}
unsafe extern "C" {
    pub fn fnvlist_add_uint16(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: u16);
}
unsafe extern "C" {
    pub fn fnvlist_add_int32(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: i32);
}
unsafe extern "C" {
    pub fn fnvlist_add_uint32(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: u32);
}
unsafe extern "C" {
    pub fn fnvlist_add_int64(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: i64);
}
unsafe extern "C" {
    pub fn fnvlist_add_uint64(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char, arg3: u64);
}
unsafe extern "C" {
    pub fn fnvlist_add_string(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_nvlist(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut nvlist_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t);
}
unsafe extern "C" {
    pub fn fnvlist_add_boolean_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut boolean_t,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_byte_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut uchar_t,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_int8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i8,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_uint8_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u8,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_int16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i16,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_uint16_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u16,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_int32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i32,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_uint32_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u32,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_int64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut i64,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_uint64_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut u64,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_string_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const *mut ::std::os::raw::c_char,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_add_nvlist_array(
        arg1: *mut nvlist_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut nvlist_t,
        arg4: uint_t,
    );
}
unsafe extern "C" {
    pub fn fnvlist_remove(arg1: *mut nvlist_t, arg2: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fnvlist_remove_nvpair(arg1: *mut nvlist_t, arg2: *mut nvpair_t);
}
unsafe extern "C" {
    pub fn fnvlist_lookup_nvpair(
        nvl: *mut nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *mut nvpair_t;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_boolean(
        nvl: *mut nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> boolean_t;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_boolean_value(
        nvl: *mut nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> boolean_t;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_byte(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> uchar_t;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_int8(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> i8;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_int16(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> i16;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_int32(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> i32;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_int64(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> i64;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_uint8(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> u8;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_uint16(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> u16;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_uint32(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> u32;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_uint64(nvl: *mut nvlist_t, name: *const ::std::os::raw::c_char) -> u64;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_string(
        nvl: *mut nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fnvlist_lookup_nvlist(
        nvl: *mut nvlist_t,
        name: *const ::std::os::raw::c_char,
    ) -> *mut nvlist_t;
}
unsafe extern "C" {
    pub fn fnvpair_value_boolean_value(nvp: *mut nvpair_t) -> boolean_t;
}
unsafe extern "C" {
    pub fn fnvpair_value_byte(nvp: *mut nvpair_t) -> uchar_t;
}
unsafe extern "C" {
    pub fn fnvpair_value_int8(nvp: *mut nvpair_t) -> i8;
}
unsafe extern "C" {
    pub fn fnvpair_value_int16(nvp: *mut nvpair_t) -> i16;
}
unsafe extern "C" {
    pub fn fnvpair_value_int32(nvp: *mut nvpair_t) -> i32;
}
unsafe extern "C" {
    pub fn fnvpair_value_int64(nvp: *mut nvpair_t) -> i64;
}
unsafe extern "C" {
    pub fn fnvpair_value_uint8(nvp: *mut nvpair_t) -> u8;
}
unsafe extern "C" {
    pub fn fnvpair_value_uint16(nvp: *mut nvpair_t) -> u16;
}
unsafe extern "C" {
    pub fn fnvpair_value_uint32(nvp: *mut nvpair_t) -> u32;
}
unsafe extern "C" {
    pub fn fnvpair_value_uint64(nvp: *mut nvpair_t) -> u64;
}
unsafe extern "C" {
    pub fn fnvpair_value_string(nvp: *mut nvpair_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fnvpair_value_nvlist(nvp: *mut nvpair_t) -> *mut nvlist_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __FILE {
    pub __pad: [::std::os::raw::c_long; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __FILE"][::std::mem::size_of::<__FILE>() - 128usize];
    ["Alignment of __FILE"][::std::mem::align_of::<__FILE>() - 8usize];
    ["Offset of field: __FILE::__pad"][::std::mem::offset_of!(__FILE, __pad) - 0usize];
};
pub type FILE = __FILE;
pub type fpos_t = ::std::os::raw::c_long;
unsafe extern "C" {
    pub static mut __iob: [__FILE; 20usize];
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
pub type fpos64_t = fpos_t;
unsafe extern "C" {
    pub static mut _sibuf: [::std::os::raw::c_uchar; 0usize];
}
unsafe extern "C" {
    pub static mut _sobuf: [::std::os::raw::c_uchar; 0usize];
}
unsafe extern "C" {
    pub fn tmpnam_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fdclose(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char, arg3: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn tempnam(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cuserid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getopt(
        arg1: ::std::os::raw::c_int,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseeko(
        arg1: *mut FILE,
        arg2: off_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn fmemopen(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize) -> *mut FILE;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
pub type va_list = __builtin_va_list;
unsafe extern "C" {
    pub static mut errno: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __mb_cur_max() -> ::std::os::raw::c_uchar;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
pub type wchar_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn abs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atof(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn bsearch(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: usize,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn div(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn free(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn labs(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn ldiv(arg1: ::std::os::raw::c_long, arg2: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn malloc(arg1: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mblen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::std::os::raw::c_char, arg3: usize) -> usize;
}
unsafe extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qsort(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realloc(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn srand(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn strtod(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtol(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn system(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcstombs(arg1: *mut ::std::os::raw::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn _Exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn strtof(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn atoll(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llabs(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lldiv(arg1: ::std::os::raw::c_longlong, arg2: ::std::os::raw::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn strtoll(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn quick_exit(arg1: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn rand_r(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _exithandle();
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(arg1: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn jrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lcong48(arg1: *mut ::std::os::raw::c_ushort);
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn seed48(arg1: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn srand48(arg1: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn putenv(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setkey(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn swab(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
        arg3: isize,
    );
}
unsafe extern "C" {
    pub fn mkstemp(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkostemp(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkostemps(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn a64l(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn ecvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn grantpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn l64a(arg1: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mktemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ptsname(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn realpath(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn srandom(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn unlockpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn valloc(arg1: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn posix_openpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn canonicalize_file_name(
        arg1: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn closefrom(arg1: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn daemon(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dup2(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dup3(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fdwalk(
        arg1: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt(
        arg1: u128,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        arg1: u128,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        arg1: u128,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getcwd(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getexecname() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}getloginx"]
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getpass(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getpassphrase(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getpw(arg1: uid_t, arg2: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isatty(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memalign(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn ttyname(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getprogname() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setprogname(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn lltostr(
        arg1: ::std::os::raw::c_longlong,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ulltostr(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(arg1: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(arg1: intmax_t, arg2: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn arc4random() -> u32;
}
unsafe extern "C" {
    pub fn arc4random_buf(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(arg1: u32) -> u32;
}
unsafe extern "C" {
    pub fn freezero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn recallocarray(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strtonum(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtonumx(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: *mut *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn reallocf(arg1: *mut ::std::os::raw::c_void, arg2: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strtof_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtod_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtold_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> u128;
}
unsafe extern "C" {
    pub fn ptsname_r(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qsort_r(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        arg5: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn reallocarray(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn secure_getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
pub type regoff_t = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regex_t {
    pub re_nsub: usize,
    pub re_g: *mut re_guts,
    pub re_magic: ::std::os::raw::c_int,
    pub re_endp: *const ::std::os::raw::c_char,
    pub re_len: usize,
    pub re_sc: *mut _regex_ext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regex_t"][::std::mem::size_of::<regex_t>() - 48usize];
    ["Alignment of regex_t"][::std::mem::align_of::<regex_t>() - 8usize];
    ["Offset of field: regex_t::re_nsub"][::std::mem::offset_of!(regex_t, re_nsub) - 0usize];
    ["Offset of field: regex_t::re_g"][::std::mem::offset_of!(regex_t, re_g) - 8usize];
    ["Offset of field: regex_t::re_magic"][::std::mem::offset_of!(regex_t, re_magic) - 16usize];
    ["Offset of field: regex_t::re_endp"][::std::mem::offset_of!(regex_t, re_endp) - 24usize];
    ["Offset of field: regex_t::re_len"][::std::mem::offset_of!(regex_t, re_len) - 32usize];
    ["Offset of field: regex_t::re_sc"][::std::mem::offset_of!(regex_t, re_sc) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_t {
    pub rm_sp: *const ::std::os::raw::c_char,
    pub rm_ep: *const ::std::os::raw::c_char,
    pub rm_so: regoff_t,
    pub rm_eo: regoff_t,
    pub rm_ss: ::std::os::raw::c_int,
    pub rm_es: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regmatch_t"][::std::mem::size_of::<regmatch_t>() - 40usize];
    ["Alignment of regmatch_t"][::std::mem::align_of::<regmatch_t>() - 8usize];
    ["Offset of field: regmatch_t::rm_sp"][::std::mem::offset_of!(regmatch_t, rm_sp) - 0usize];
    ["Offset of field: regmatch_t::rm_ep"][::std::mem::offset_of!(regmatch_t, rm_ep) - 8usize];
    ["Offset of field: regmatch_t::rm_so"][::std::mem::offset_of!(regmatch_t, rm_so) - 16usize];
    ["Offset of field: regmatch_t::rm_eo"][::std::mem::offset_of!(regmatch_t, rm_eo) - 24usize];
    ["Offset of field: regmatch_t::rm_ss"][::std::mem::offset_of!(regmatch_t, rm_ss) - 32usize];
    ["Offset of field: regmatch_t::rm_es"][::std::mem::offset_of!(regmatch_t, rm_es) - 36usize];
};
unsafe extern "C" {
    pub fn regcomp(
        arg1: *mut regex_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn regexec(
        arg1: *const regex_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: *mut regmatch_t,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn regerror(
        arg1: ::std::os::raw::c_int,
        arg2: *const regex_t,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn regfree(arg1: *mut regex_t);
}
unsafe extern "C" {
    pub fn nvpair_value_match(
        arg1: *mut nvpair_t,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvpair_value_match_regex(
        arg1: *mut nvpair_t,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut regex_t,
        arg5: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nvlist_print(arg1: *mut FILE, arg2: *mut nvlist_t);
}
unsafe extern "C" {
    pub fn nvlist_print_json(arg1: *mut FILE, arg2: *mut nvlist_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dump_nvlist(arg1: *mut nvlist_t, arg2: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nvlist_prtctl {
    _unused: [u8; 0],
}
pub type nvlist_prtctl_t = *mut nvlist_prtctl;
pub const nvlist_indent_mode_NVLIST_INDENT_ABS: nvlist_indent_mode = 0;
pub const nvlist_indent_mode_NVLIST_INDENT_TABBED: nvlist_indent_mode = 1;
pub type nvlist_indent_mode = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn nvlist_prtctl_alloc() -> nvlist_prtctl_t;
}
unsafe extern "C" {
    pub fn nvlist_prtctl_free(arg1: nvlist_prtctl_t);
}
unsafe extern "C" {
    pub fn nvlist_prt(arg1: *mut nvlist_t, arg2: nvlist_prtctl_t);
}
unsafe extern "C" {
    pub fn nvlist_prtctl_setdest(arg1: nvlist_prtctl_t, arg2: *mut FILE);
}
unsafe extern "C" {
    pub fn nvlist_prtctl_getdest(arg1: nvlist_prtctl_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn nvlist_prtctl_setindent(
        arg1: nvlist_prtctl_t,
        arg2: nvlist_indent_mode,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctl_doindent(arg1: nvlist_prtctl_t, arg2: ::std::os::raw::c_int);
}
pub const nvlist_prtctl_fmt_NVLIST_FMT_MEMBER_NAME: nvlist_prtctl_fmt = 0;
pub const nvlist_prtctl_fmt_NVLIST_FMT_MEMBER_POSTAMBLE: nvlist_prtctl_fmt = 1;
pub const nvlist_prtctl_fmt_NVLIST_FMT_BTWN_ARRAY: nvlist_prtctl_fmt = 2;
pub type nvlist_prtctl_fmt = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn nvlist_prtctl_setfmt(
        arg1: nvlist_prtctl_t,
        arg2: nvlist_prtctl_fmt,
        arg3: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctl_dofmt(arg1: nvlist_prtctl_t, arg2: nvlist_prtctl_fmt, ...);
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_boolean(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_boolean_value(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: boolean_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_byte(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: uchar_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int8(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: i8,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint8(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: u8,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int16(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: i16,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint16(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: u16,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int32(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: i32,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint32(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: u32,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int64(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: i64,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint64(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: u64,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_double(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: f64,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_string(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut ::std::os::raw::c_char,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_hrtime(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: hrtime_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_nvlist(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut nvlist_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_boolean_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut boolean_t,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_byte_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut uchar_t,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int8_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut i8,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint8_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut u8,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int16_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut i16,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint16_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut u16,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int32_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut i32,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint32_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut u32,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_int64_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut i64,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_uint64_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut u64,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_string_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut *mut ::std::os::raw::c_char,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn nvlist_prtctlop_nvlist_array(
        arg1: nvlist_prtctl_t,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: nvlist_prtctl_t,
                arg2: *mut ::std::os::raw::c_void,
                arg3: *mut nvlist_t,
                arg4: *const ::std::os::raw::c_char,
                arg5: *mut *mut nvlist_t,
                arg6: uint_t,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_dma_handle {
    _unused: [u8; 0],
}
pub type ddi_dma_handle_t = *mut __ddi_dma_handle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_dma_win {
    _unused: [u8; 0],
}
pub type ddi_dma_win_t = *mut __ddi_dma_win;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_dma_seg {
    _unused: [u8; 0],
}
pub type ddi_dma_seg_t = *mut __ddi_dma_seg;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ddi_dma_cookie_t {
    pub _dmu: ddi_dma_cookie_t__bindgen_ty_1,
    pub dmac_size: usize,
    pub dmac_type: uint_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ddi_dma_cookie_t__bindgen_ty_1 {
    pub _dmac_ll: u64,
    pub _dmac_la: [u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_dma_cookie_t__bindgen_ty_1"]
        [::std::mem::size_of::<ddi_dma_cookie_t__bindgen_ty_1>() - 8usize];
    ["Alignment of ddi_dma_cookie_t__bindgen_ty_1"]
        [::std::mem::align_of::<ddi_dma_cookie_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: ddi_dma_cookie_t__bindgen_ty_1::_dmac_ll"]
        [::std::mem::offset_of!(ddi_dma_cookie_t__bindgen_ty_1, _dmac_ll) - 0usize];
    ["Offset of field: ddi_dma_cookie_t__bindgen_ty_1::_dmac_la"]
        [::std::mem::offset_of!(ddi_dma_cookie_t__bindgen_ty_1, _dmac_la) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_dma_cookie_t"][::std::mem::size_of::<ddi_dma_cookie_t>() - 24usize];
    ["Alignment of ddi_dma_cookie_t"][::std::mem::align_of::<ddi_dma_cookie_t>() - 8usize];
    ["Offset of field: ddi_dma_cookie_t::_dmu"]
        [::std::mem::offset_of!(ddi_dma_cookie_t, _dmu) - 0usize];
    ["Offset of field: ddi_dma_cookie_t::dmac_size"]
        [::std::mem::offset_of!(ddi_dma_cookie_t, dmac_size) - 8usize];
    ["Offset of field: ddi_dma_cookie_t::dmac_type"]
        [::std::mem::offset_of!(ddi_dma_cookie_t, dmac_type) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_iblock_cookie {
    _unused: [u8; 0],
}
pub type ddi_iblock_cookie_t = *mut __ddi_iblock_cookie;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ddi_idevice_cookie_t {
    pub idu: ddi_idevice_cookie_t__bindgen_ty_1,
    pub idev_softint: uint_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddi_idevice_cookie_t__bindgen_ty_1 {
    pub _idev_vector: ushort_t,
    pub _idev_priority: ushort_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_idevice_cookie_t__bindgen_ty_1"]
        [::std::mem::size_of::<ddi_idevice_cookie_t__bindgen_ty_1>() - 4usize];
    ["Alignment of ddi_idevice_cookie_t__bindgen_ty_1"]
        [::std::mem::align_of::<ddi_idevice_cookie_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: ddi_idevice_cookie_t__bindgen_ty_1::_idev_vector"]
        [::std::mem::offset_of!(ddi_idevice_cookie_t__bindgen_ty_1, _idev_vector) - 0usize];
    ["Offset of field: ddi_idevice_cookie_t__bindgen_ty_1::_idev_priority"]
        [::std::mem::offset_of!(ddi_idevice_cookie_t__bindgen_ty_1, _idev_priority) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_idevice_cookie_t"][::std::mem::size_of::<ddi_idevice_cookie_t>() - 4usize];
    ["Alignment of ddi_idevice_cookie_t"][::std::mem::align_of::<ddi_idevice_cookie_t>() - 4usize];
    ["Offset of field: ddi_idevice_cookie_t::idu"]
        [::std::mem::offset_of!(ddi_idevice_cookie_t, idu) - 0usize];
    ["Offset of field: ddi_idevice_cookie_t::idev_softint"]
        [::std::mem::offset_of!(ddi_idevice_cookie_t, idev_softint) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_regspec {
    _unused: [u8; 0],
}
pub type ddi_regspec_t = *mut __ddi_regspec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_intrspec {
    _unused: [u8; 0],
}
pub type ddi_intrspec_t = *mut __ddi_intrspec;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_softintr {
    _unused: [u8; 0],
}
pub type ddi_softintr_t = *mut __ddi_softintr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dev_info {
    _unused: [u8; 0],
}
pub type dev_info_t = *mut __dev_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_devmap_data {
    _unused: [u8; 0],
}
pub type ddi_devmap_data_t = *mut __ddi_devmap_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __ddi_devid {
    _unused: [u8; 0],
}
pub type ddi_devid_t = *mut __ddi_devid;
pub const ddi_devmap_cmd_t_DDI_DEVMAP_VALIDATE: ddi_devmap_cmd_t = 0;
pub type ddi_devmap_cmd_t = ::std::os::raw::c_uint;
pub const ddi_node_state_t_DS_INVAL: ddi_node_state_t = -1;
pub const ddi_node_state_t_DS_PROTO: ddi_node_state_t = 0;
pub const ddi_node_state_t_DS_LINKED: ddi_node_state_t = 1;
pub const ddi_node_state_t_DS_BOUND: ddi_node_state_t = 2;
pub const ddi_node_state_t_DS_INITIALIZED: ddi_node_state_t = 3;
pub const ddi_node_state_t_DS_PROBED: ddi_node_state_t = 4;
pub const ddi_node_state_t_DS_ATTACHED: ddi_node_state_t = 5;
pub const ddi_node_state_t_DS_READY: ddi_node_state_t = 6;
pub type ddi_node_state_t = ::std::os::raw::c_int;
pub const ddi_plevel_t_EPL_KERNEL: ddi_plevel_t = 0;
pub const ddi_plevel_t_EPL_INTERRUPT: ddi_plevel_t = 1;
pub const ddi_plevel_t_EPL_HIGHLEVEL: ddi_plevel_t = 2;
pub type ddi_plevel_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddi_event_cookie {
    _unused: [u8; 0],
}
pub type ddi_eventcookie_t = *mut ddi_event_cookie;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddi_event_callbacks {
    _unused: [u8; 0],
}
pub type ddi_callback_id_t = *mut ddi_event_callbacks;
pub type ddi_event_cb_f = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut dev_info_t,
        arg2: ddi_eventcookie_t,
        arg: *mut ::std::os::raw::c_void,
        impldata: *mut ::std::os::raw::c_void,
    ),
>;
pub const ddi_prop_op_t_PROP_LEN: ddi_prop_op_t = 0;
pub const ddi_prop_op_t_PROP_LEN_AND_VAL_BUF: ddi_prop_op_t = 1;
pub const ddi_prop_op_t_PROP_LEN_AND_VAL_ALLOC: ddi_prop_op_t = 2;
pub const ddi_prop_op_t_PROP_EXISTS: ddi_prop_op_t = 3;
pub type ddi_prop_op_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddi_prop {
    pub prop_next: *mut ddi_prop,
    pub prop_dev: dev_t,
    pub prop_name: *mut ::std::os::raw::c_char,
    pub prop_flags: ::std::os::raw::c_int,
    pub prop_len: ::std::os::raw::c_int,
    pub prop_val: caddr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_prop"][::std::mem::size_of::<ddi_prop>() - 40usize];
    ["Alignment of ddi_prop"][::std::mem::align_of::<ddi_prop>() - 8usize];
    ["Offset of field: ddi_prop::prop_next"][::std::mem::offset_of!(ddi_prop, prop_next) - 0usize];
    ["Offset of field: ddi_prop::prop_dev"][::std::mem::offset_of!(ddi_prop, prop_dev) - 8usize];
    ["Offset of field: ddi_prop::prop_name"][::std::mem::offset_of!(ddi_prop, prop_name) - 16usize];
    ["Offset of field: ddi_prop::prop_flags"]
        [::std::mem::offset_of!(ddi_prop, prop_flags) - 24usize];
    ["Offset of field: ddi_prop::prop_len"][::std::mem::offset_of!(ddi_prop, prop_len) - 28usize];
    ["Offset of field: ddi_prop::prop_val"][::std::mem::offset_of!(ddi_prop, prop_val) - 32usize];
};
pub type ddi_prop_t = ddi_prop;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddi_prop_list {
    pub prop_list: *mut ddi_prop_t,
    pub prop_ref: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_prop_list"][::std::mem::size_of::<ddi_prop_list>() - 16usize];
    ["Alignment of ddi_prop_list"][::std::mem::align_of::<ddi_prop_list>() - 8usize];
    ["Offset of field: ddi_prop_list::prop_list"]
        [::std::mem::offset_of!(ddi_prop_list, prop_list) - 0usize];
    ["Offset of field: ddi_prop_list::prop_ref"]
        [::std::mem::offset_of!(ddi_prop_list, prop_ref) - 8usize];
};
pub type ddi_prop_list_t = ddi_prop_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddi_prop_handle {
    pub ph_data: *mut ::std::os::raw::c_void,
    pub ph_cur_pos: *mut ::std::os::raw::c_void,
    pub ph_save_pos: *mut ::std::os::raw::c_void,
    pub ph_size: uint_t,
    pub ph_flags: uint_t,
    pub ph_ops: *mut prop_handle_ops,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddi_prop_handle"][::std::mem::size_of::<ddi_prop_handle>() - 40usize];
    ["Alignment of ddi_prop_handle"][::std::mem::align_of::<ddi_prop_handle>() - 8usize];
    ["Offset of field: ddi_prop_handle::ph_data"]
        [::std::mem::offset_of!(ddi_prop_handle, ph_data) - 0usize];
    ["Offset of field: ddi_prop_handle::ph_cur_pos"]
        [::std::mem::offset_of!(ddi_prop_handle, ph_cur_pos) - 8usize];
    ["Offset of field: ddi_prop_handle::ph_save_pos"]
        [::std::mem::offset_of!(ddi_prop_handle, ph_save_pos) - 16usize];
    ["Offset of field: ddi_prop_handle::ph_size"]
        [::std::mem::offset_of!(ddi_prop_handle, ph_size) - 24usize];
    ["Offset of field: ddi_prop_handle::ph_flags"]
        [::std::mem::offset_of!(ddi_prop_handle, ph_flags) - 28usize];
    ["Offset of field: ddi_prop_handle::ph_ops"]
        [::std::mem::offset_of!(ddi_prop_handle, ph_ops) - 32usize];
};
pub type prop_handle_t = ddi_prop_handle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prop_handle_ops {
    pub op_prop_int: ::std::option::Option<
        unsafe extern "C" fn(
            ph: *mut prop_handle_t,
            cmd: uint_t,
            data: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub op_prop_str: ::std::option::Option<
        unsafe extern "C" fn(
            ph: *mut prop_handle_t,
            cmd: uint_t,
            data: *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub op_prop_bytes: ::std::option::Option<
        unsafe extern "C" fn(
            ph: *mut prop_handle_t,
            cmd: uint_t,
            data: *mut uchar_t,
            size: uint_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub op_prop_int64: ::std::option::Option<
        unsafe extern "C" fn(
            ph: *mut prop_handle_t,
            cmd: uint_t,
            data: *mut i64,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of prop_handle_ops"][::std::mem::size_of::<prop_handle_ops>() - 32usize];
    ["Alignment of prop_handle_ops"][::std::mem::align_of::<prop_handle_ops>() - 8usize];
    ["Offset of field: prop_handle_ops::op_prop_int"]
        [::std::mem::offset_of!(prop_handle_ops, op_prop_int) - 0usize];
    ["Offset of field: prop_handle_ops::op_prop_str"]
        [::std::mem::offset_of!(prop_handle_ops, op_prop_str) - 8usize];
    ["Offset of field: prop_handle_ops::op_prop_bytes"]
        [::std::mem::offset_of!(prop_handle_ops, op_prop_bytes) - 16usize];
    ["Offset of field: prop_handle_ops::op_prop_int64"]
        [::std::mem::offset_of!(prop_handle_ops, op_prop_int64) - 24usize];
};
pub type prop_handle_ops_t = prop_handle_ops;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prop_driver_data {
    pub pdd_size: usize,
    pub pdd_prop_free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut prop_driver_data)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of prop_driver_data"][::std::mem::size_of::<prop_driver_data>() - 16usize];
    ["Alignment of prop_driver_data"][::std::mem::align_of::<prop_driver_data>() - 8usize];
    ["Offset of field: prop_driver_data::pdd_size"]
        [::std::mem::offset_of!(prop_driver_data, pdd_size) - 0usize];
    ["Offset of field: prop_driver_data::pdd_prop_free"]
        [::std::mem::offset_of!(prop_driver_data, pdd_prop_free) - 8usize];
};
pub const ddi_prop_cmd_t_DDI_PROP_CMD_GET_ESIZE: ddi_prop_cmd_t = 0;
pub const ddi_prop_cmd_t_DDI_PROP_CMD_GET_DSIZE: ddi_prop_cmd_t = 1;
pub const ddi_prop_cmd_t_DDI_PROP_CMD_DECODE: ddi_prop_cmd_t = 2;
pub const ddi_prop_cmd_t_DDI_PROP_CMD_ENCODE: ddi_prop_cmd_t = 3;
pub const ddi_prop_cmd_t_DDI_PROP_CMD_SKIP: ddi_prop_cmd_t = 4;
pub type ddi_prop_cmd_t = ::std::os::raw::c_uint;
pub const ddi_prop_result_t_DDI_PROP_RESULT_ERROR: ddi_prop_result_t = -2;
pub const ddi_prop_result_t_DDI_PROP_RESULT_EOF: ddi_prop_result_t = -1;
pub const ddi_prop_result_t_DDI_PROP_RESULT_OK: ddi_prop_result_t = 0;
pub type ddi_prop_result_t = ::std::os::raw::c_int;
pub type prop_1275_cell_t = u32;
unsafe extern "C" {
    pub fn ddi_prop_search_common(
        dev: dev_t,
        dip: *mut dev_info_t,
        prop_op: ddi_prop_op_t,
        flags: uint_t,
        name: *mut ::std::os::raw::c_char,
        valuep: *mut ::std::os::raw::c_void,
        lengthp: *mut uint_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cred {
    _unused: [u8; 0],
}
pub type cred_t = cred;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: caddr_t,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
pub type iovec_t = iovec;
pub const uio_seg_UIO_USERSPACE: uio_seg = 0;
pub const uio_seg_UIO_SYSSPACE: uio_seg = 1;
pub const uio_seg_UIO_USERISPACE: uio_seg = 2;
pub type uio_seg = ::std::os::raw::c_uint;
pub use self::uio_seg as uio_seg_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct uio {
    pub uio_iov: *mut iovec_t,
    pub uio_iovcnt: ::std::os::raw::c_int,
    pub _uio_offset: lloff_t,
    pub uio_segflg: uio_seg_t,
    pub uio_fmode: u16,
    pub uio_extflg: u16,
    pub _uio_limit: lloff_t,
    pub uio_resid: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uio"][::std::mem::size_of::<uio>() - 48usize];
    ["Alignment of uio"][::std::mem::align_of::<uio>() - 8usize];
    ["Offset of field: uio::uio_iov"][::std::mem::offset_of!(uio, uio_iov) - 0usize];
    ["Offset of field: uio::uio_iovcnt"][::std::mem::offset_of!(uio, uio_iovcnt) - 8usize];
    ["Offset of field: uio::_uio_offset"][::std::mem::offset_of!(uio, _uio_offset) - 16usize];
    ["Offset of field: uio::uio_segflg"][::std::mem::offset_of!(uio, uio_segflg) - 24usize];
    ["Offset of field: uio::uio_fmode"][::std::mem::offset_of!(uio, uio_fmode) - 28usize];
    ["Offset of field: uio::uio_extflg"][::std::mem::offset_of!(uio, uio_extflg) - 30usize];
    ["Offset of field: uio::_uio_limit"][::std::mem::offset_of!(uio, _uio_limit) - 32usize];
    ["Offset of field: uio::uio_resid"][::std::mem::offset_of!(uio, uio_resid) - 40usize];
};
pub type uio_t = uio;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uioa_page_s {
    pub uioa_pfncnt: ::std::os::raw::c_int,
    pub uioa_ppp: *mut *mut ::std::os::raw::c_void,
    pub uioa_base: caddr_t,
    pub uioa_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uioa_page_s"][::std::mem::size_of::<uioa_page_s>() - 32usize];
    ["Alignment of uioa_page_s"][::std::mem::align_of::<uioa_page_s>() - 8usize];
    ["Offset of field: uioa_page_s::uioa_pfncnt"]
        [::std::mem::offset_of!(uioa_page_s, uioa_pfncnt) - 0usize];
    ["Offset of field: uioa_page_s::uioa_ppp"]
        [::std::mem::offset_of!(uioa_page_s, uioa_ppp) - 8usize];
    ["Offset of field: uioa_page_s::uioa_base"]
        [::std::mem::offset_of!(uioa_page_s, uioa_base) - 16usize];
    ["Offset of field: uioa_page_s::uioa_len"]
        [::std::mem::offset_of!(uioa_page_s, uioa_len) - 24usize];
};
pub type uioa_page_t = uioa_page_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct uioa_s {
    pub uio_iov: *mut iovec_t,
    pub uio_iovcnt: ::std::os::raw::c_int,
    pub _uio_offset: lloff_t,
    pub uio_segflg: uio_seg_t,
    pub uio_fmode: u16,
    pub uio_extflg: u16,
    pub _uio_limit: lloff_t,
    pub uio_resid: isize,
    pub uioa_state: u32,
    pub uioa_mbytes: isize,
    pub uioa_lcur: *mut uioa_page_t,
    pub uioa_lppp: *mut *mut ::std::os::raw::c_void,
    pub uioa_hwst: [*mut ::std::os::raw::c_void; 4usize],
    pub uioa_locked: [uioa_page_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uioa_s"][::std::mem::size_of::<uioa_s>() - 624usize];
    ["Alignment of uioa_s"][::std::mem::align_of::<uioa_s>() - 8usize];
    ["Offset of field: uioa_s::uio_iov"][::std::mem::offset_of!(uioa_s, uio_iov) - 0usize];
    ["Offset of field: uioa_s::uio_iovcnt"][::std::mem::offset_of!(uioa_s, uio_iovcnt) - 8usize];
    ["Offset of field: uioa_s::_uio_offset"][::std::mem::offset_of!(uioa_s, _uio_offset) - 16usize];
    ["Offset of field: uioa_s::uio_segflg"][::std::mem::offset_of!(uioa_s, uio_segflg) - 24usize];
    ["Offset of field: uioa_s::uio_fmode"][::std::mem::offset_of!(uioa_s, uio_fmode) - 28usize];
    ["Offset of field: uioa_s::uio_extflg"][::std::mem::offset_of!(uioa_s, uio_extflg) - 30usize];
    ["Offset of field: uioa_s::_uio_limit"][::std::mem::offset_of!(uioa_s, _uio_limit) - 32usize];
    ["Offset of field: uioa_s::uio_resid"][::std::mem::offset_of!(uioa_s, uio_resid) - 40usize];
    ["Offset of field: uioa_s::uioa_state"][::std::mem::offset_of!(uioa_s, uioa_state) - 48usize];
    ["Offset of field: uioa_s::uioa_mbytes"][::std::mem::offset_of!(uioa_s, uioa_mbytes) - 56usize];
    ["Offset of field: uioa_s::uioa_lcur"][::std::mem::offset_of!(uioa_s, uioa_lcur) - 64usize];
    ["Offset of field: uioa_s::uioa_lppp"][::std::mem::offset_of!(uioa_s, uioa_lppp) - 72usize];
    ["Offset of field: uioa_s::uioa_hwst"][::std::mem::offset_of!(uioa_s, uioa_hwst) - 80usize];
    ["Offset of field: uioa_s::uioa_locked"]
        [::std::mem::offset_of!(uioa_s, uioa_locked) - 112usize];
};
pub type uioa_t = uioa_s;
pub const xuio_type_UIOTYPE_ASYNCIO: xuio_type = 0;
pub const xuio_type_UIOTYPE_ZEROCOPY: xuio_type = 1;
pub type xuio_type = ::std::os::raw::c_uint;
pub use self::xuio_type as xuio_type_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xuio {
    pub xu_uio: uio_t,
    pub xu_type: xuio_type,
    pub xu_ext: xuio__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xuio__bindgen_ty_1 {
    pub xu_aio: xuio__bindgen_ty_1__bindgen_ty_1,
    pub xu_zc: xuio__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xuio__bindgen_ty_1__bindgen_ty_1 {
    pub xu_a_state: u32,
    pub xu_a_mbytes: isize,
    pub xu_a_lcur: *mut uioa_page_t,
    pub xu_a_lppp: *mut *mut ::std::os::raw::c_void,
    pub xu_a_hwst: [*mut ::std::os::raw::c_void; 4usize],
    pub xu_a_locked: [uioa_page_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xuio__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<xuio__bindgen_ty_1__bindgen_ty_1>() - 576usize];
    ["Alignment of xuio__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<xuio__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_1::xu_a_state"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_1, xu_a_state) - 0usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_1::xu_a_mbytes"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_1, xu_a_mbytes) - 8usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_1::xu_a_lcur"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_1, xu_a_lcur) - 16usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_1::xu_a_lppp"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_1, xu_a_lppp) - 24usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_1::xu_a_hwst"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_1, xu_a_hwst) - 32usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_1::xu_a_locked"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_1, xu_a_locked) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xuio__bindgen_ty_1__bindgen_ty_2 {
    pub xu_zc_rw: ::std::os::raw::c_int,
    pub xu_zc_priv: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xuio__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<xuio__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of xuio__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<xuio__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_2::xu_zc_rw"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_2, xu_zc_rw) - 0usize];
    ["Offset of field: xuio__bindgen_ty_1__bindgen_ty_2::xu_zc_priv"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1__bindgen_ty_2, xu_zc_priv) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xuio__bindgen_ty_1"][::std::mem::size_of::<xuio__bindgen_ty_1>() - 576usize];
    ["Alignment of xuio__bindgen_ty_1"][::std::mem::align_of::<xuio__bindgen_ty_1>() - 8usize];
    ["Offset of field: xuio__bindgen_ty_1::xu_aio"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1, xu_aio) - 0usize];
    ["Offset of field: xuio__bindgen_ty_1::xu_zc"]
        [::std::mem::offset_of!(xuio__bindgen_ty_1, xu_zc) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xuio"][::std::mem::size_of::<xuio>() - 632usize];
    ["Alignment of xuio"][::std::mem::align_of::<xuio>() - 8usize];
    ["Offset of field: xuio::xu_uio"][::std::mem::offset_of!(xuio, xu_uio) - 0usize];
    ["Offset of field: xuio::xu_type"][::std::mem::offset_of!(xuio, xu_type) - 48usize];
    ["Offset of field: xuio::xu_ext"][::std::mem::offset_of!(xuio, xu_ext) - 56usize];
};
pub type xuio_t = xuio;
pub const uio_rw_UIO_READ: uio_rw = 0;
pub const uio_rw_UIO_WRITE: uio_rw = 1;
pub type uio_rw = ::std::os::raw::c_uint;
pub use self::uio_rw as uio_rw_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uioasync_s {
    pub enabled: boolean_t,
    pub mincnt: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uioasync_s"][::std::mem::size_of::<uioasync_s>() - 16usize];
    ["Alignment of uioasync_s"][::std::mem::align_of::<uioasync_s>() - 8usize];
    ["Offset of field: uioasync_s::enabled"][::std::mem::offset_of!(uioasync_s, enabled) - 0usize];
    ["Offset of field: uioasync_s::mincnt"][::std::mem::offset_of!(uioasync_s, mincnt) - 8usize];
};
pub type uioasync_t = uioasync_s;
unsafe extern "C" {
    pub fn readv(
        arg1: ::std::os::raw::c_int,
        arg2: *const iovec,
        arg3: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn writev(
        arg1: ::std::os::raw::c_int,
        arg2: *const iovec,
        arg3: ::std::os::raw::c_int,
    ) -> isize;
}
unsafe extern "C" {
    pub fn preadv(
        arg1: ::std::os::raw::c_int,
        arg2: *const iovec,
        arg3: ::std::os::raw::c_int,
        arg4: off_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn pwritev(
        arg1: ::std::os::raw::c_int,
        arg2: *const iovec,
        arg3: ::std::os::raw::c_int,
        arg4: off_t,
    ) -> isize;
}
pub type caddr32_t = u32;
pub type daddr32_t = i32;
pub type off32_t = i32;
pub type ino32_t = u32;
pub type blkcnt32_t = i32;
pub type fsblkcnt32_t = u32;
pub type fsfilcnt32_t = u32;
pub type id32_t = i32;
pub type major32_t = u32;
pub type minor32_t = u32;
pub type key32_t = i32;
pub type mode32_t = u32;
pub type uid32_t = u32;
pub type gid32_t = u32;
pub type nlink32_t = u32;
pub type dev32_t = u32;
pub type pid32_t = i32;
pub type size32_t = u32;
pub type ssize32_t = i32;
pub type time32_t = i32;
pub type clock32_t = i32;
pub type uintptr32_t = u32;
pub type intptr32_t = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval32 {
    pub tv_sec: time32_t,
    pub tv_usec: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval32"][::std::mem::size_of::<timeval32>() - 8usize];
    ["Alignment of timeval32"][::std::mem::align_of::<timeval32>() - 4usize];
    ["Offset of field: timeval32::tv_sec"][::std::mem::offset_of!(timeval32, tv_sec) - 0usize];
    ["Offset of field: timeval32::tv_usec"][::std::mem::offset_of!(timeval32, tv_usec) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec32 {
    pub tv_sec: time32_t,
    pub tv_nsec: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec32"][::std::mem::size_of::<timespec32>() - 8usize];
    ["Alignment of timespec32"][::std::mem::align_of::<timespec32>() - 4usize];
    ["Offset of field: timespec32::tv_sec"][::std::mem::offset_of!(timespec32, tv_sec) - 0usize];
    ["Offset of field: timespec32::tv_nsec"][::std::mem::offset_of!(timespec32, tv_nsec) - 4usize];
};
pub type timespec32_t = timespec32;
pub type timestruc32_t = timespec32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec32 {
    pub it_interval: timespec32,
    pub it_value: timespec32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec32"][::std::mem::size_of::<itimerspec32>() - 16usize];
    ["Alignment of itimerspec32"][::std::mem::align_of::<itimerspec32>() - 4usize];
    ["Offset of field: itimerspec32::it_interval"]
        [::std::mem::offset_of!(itimerspec32, it_interval) - 0usize];
    ["Offset of field: itimerspec32::it_value"]
        [::std::mem::offset_of!(itimerspec32, it_value) - 8usize];
};
pub type itimerspec32_t = itimerspec32;
pub type disp_lock_t = lock_t;
unsafe extern "C" {
    pub static mut hres_lock: u32;
}
unsafe extern "C" {
    pub static mut hrtime_base: hrtime_t;
}
unsafe extern "C" {
    pub static mut clock_res: ::std::os::raw::c_int;
}
pub const kmutex_type_t_MUTEX_ADAPTIVE: kmutex_type_t = 0;
pub const kmutex_type_t_MUTEX_SPIN: kmutex_type_t = 1;
pub const kmutex_type_t_MUTEX_DRIVER: kmutex_type_t = 4;
pub const kmutex_type_t_MUTEX_DEFAULT: kmutex_type_t = 6;
pub type kmutex_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mutex {
    pub _opaque: [*mut ::std::os::raw::c_void; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mutex"][::std::mem::size_of::<mutex>() - 8usize];
    ["Alignment of mutex"][::std::mem::align_of::<mutex>() - 8usize];
    ["Offset of field: mutex::_opaque"][::std::mem::offset_of!(mutex, _opaque) - 0usize];
};
pub type kmutex_t = mutex;
pub const krw_type_t_RW_DRIVER: krw_type_t = 2;
pub const krw_type_t_RW_DEFAULT: krw_type_t = 4;
pub type krw_type_t = ::std::os::raw::c_uint;
pub const krw_t_RW_WRITER: krw_t = 0;
pub const krw_t_RW_READER: krw_t = 1;
pub const krw_t_RW_READER_STARVEWRITER: krw_t = 2;
pub type krw_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _krwlock {
    pub _opaque: [*mut ::std::os::raw::c_void; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _krwlock"][::std::mem::size_of::<_krwlock>() - 8usize];
    ["Alignment of _krwlock"][::std::mem::align_of::<_krwlock>() - 8usize];
    ["Offset of field: _krwlock::_opaque"][::std::mem::offset_of!(_krwlock, _opaque) - 0usize];
};
pub type krwlock_t = _krwlock;
pub const ksema_type_t_SEMA_DEFAULT: ksema_type_t = 0;
pub const ksema_type_t_SEMA_DRIVER: ksema_type_t = 1;
pub type ksema_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ksema {
    pub _opaque: [*mut ::std::os::raw::c_void; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ksema"][::std::mem::size_of::<_ksema>() - 16usize];
    ["Alignment of _ksema"][::std::mem::align_of::<_ksema>() - 8usize];
    ["Offset of field: _ksema::_opaque"][::std::mem::offset_of!(_ksema, _opaque) - 0usize];
};
pub type ksema_t = _ksema;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _kcondvar {
    pub _opaque: ushort_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _kcondvar"][::std::mem::size_of::<_kcondvar>() - 2usize];
    ["Alignment of _kcondvar"][::std::mem::align_of::<_kcondvar>() - 2usize];
    ["Offset of field: _kcondvar::_opaque"][::std::mem::offset_of!(_kcondvar, _opaque) - 0usize];
};
pub type kcondvar_t = _kcondvar;
pub const kcv_type_t_CV_DEFAULT: kcv_type_t = 0;
pub const kcv_type_t_CV_DRIVER: kcv_type_t = 1;
pub type kcv_type_t = ::std::os::raw::c_uint;
pub type kid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kstat {
    pub ks_crtime: hrtime_t,
    pub ks_next: *mut kstat,
    pub ks_kid: kid_t,
    pub ks_module: [::std::os::raw::c_char; 31usize],
    pub ks_resv: uchar_t,
    pub ks_instance: ::std::os::raw::c_int,
    pub ks_name: [::std::os::raw::c_char; 31usize],
    pub ks_type: uchar_t,
    pub ks_class: [::std::os::raw::c_char; 31usize],
    pub ks_flags: uchar_t,
    pub ks_data: *mut ::std::os::raw::c_void,
    pub ks_ndata: uint_t,
    pub ks_data_size: usize,
    pub ks_snaptime: hrtime_t,
    pub ks_update: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut kstat,
            arg2: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub ks_private: *mut ::std::os::raw::c_void,
    pub ks_snapshot: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut kstat,
            arg2: *mut ::std::os::raw::c_void,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub ks_lock: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat"][::std::mem::size_of::<kstat>() - 184usize];
    ["Alignment of kstat"][::std::mem::align_of::<kstat>() - 8usize];
    ["Offset of field: kstat::ks_crtime"][::std::mem::offset_of!(kstat, ks_crtime) - 0usize];
    ["Offset of field: kstat::ks_next"][::std::mem::offset_of!(kstat, ks_next) - 8usize];
    ["Offset of field: kstat::ks_kid"][::std::mem::offset_of!(kstat, ks_kid) - 16usize];
    ["Offset of field: kstat::ks_module"][::std::mem::offset_of!(kstat, ks_module) - 20usize];
    ["Offset of field: kstat::ks_resv"][::std::mem::offset_of!(kstat, ks_resv) - 51usize];
    ["Offset of field: kstat::ks_instance"][::std::mem::offset_of!(kstat, ks_instance) - 52usize];
    ["Offset of field: kstat::ks_name"][::std::mem::offset_of!(kstat, ks_name) - 56usize];
    ["Offset of field: kstat::ks_type"][::std::mem::offset_of!(kstat, ks_type) - 87usize];
    ["Offset of field: kstat::ks_class"][::std::mem::offset_of!(kstat, ks_class) - 88usize];
    ["Offset of field: kstat::ks_flags"][::std::mem::offset_of!(kstat, ks_flags) - 119usize];
    ["Offset of field: kstat::ks_data"][::std::mem::offset_of!(kstat, ks_data) - 120usize];
    ["Offset of field: kstat::ks_ndata"][::std::mem::offset_of!(kstat, ks_ndata) - 128usize];
    ["Offset of field: kstat::ks_data_size"]
        [::std::mem::offset_of!(kstat, ks_data_size) - 136usize];
    ["Offset of field: kstat::ks_snaptime"][::std::mem::offset_of!(kstat, ks_snaptime) - 144usize];
    ["Offset of field: kstat::ks_update"][::std::mem::offset_of!(kstat, ks_update) - 152usize];
    ["Offset of field: kstat::ks_private"][::std::mem::offset_of!(kstat, ks_private) - 160usize];
    ["Offset of field: kstat::ks_snapshot"][::std::mem::offset_of!(kstat, ks_snapshot) - 168usize];
    ["Offset of field: kstat::ks_lock"][::std::mem::offset_of!(kstat, ks_lock) - 176usize];
};
pub type kstat_t = kstat;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kstat_named {
    pub name: [::std::os::raw::c_char; 31usize],
    pub data_type: uchar_t,
    pub value: kstat_named__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kstat_named__bindgen_ty_1 {
    pub c: [::std::os::raw::c_char; 16usize],
    pub i32_: i32,
    pub ui32: u32,
    pub str_: kstat_named__bindgen_ty_1__bindgen_ty_1,
    pub i64_: i64,
    pub ui64: u64,
    pub l: ::std::os::raw::c_long,
    pub ul: ulong_t,
    pub ll: longlong_t,
    pub ull: u_longlong_t,
    pub f: f32,
    pub d: f64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kstat_named__bindgen_ty_1__bindgen_ty_1 {
    pub addr: kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub len: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *mut ::std::os::raw::c_char,
    pub __pad: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::ptr"][::std::mem::offset_of!(
        kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        ptr
    ) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__pad"][::std::mem::offset_of!(
        kstat_named__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __pad
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_named__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kstat_named__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of kstat_named__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kstat_named__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kstat_named__bindgen_ty_1__bindgen_ty_1::addr"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1__bindgen_ty_1, addr) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1__bindgen_ty_1::len"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1__bindgen_ty_1, len) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_named__bindgen_ty_1"]
        [::std::mem::size_of::<kstat_named__bindgen_ty_1>() - 16usize];
    ["Alignment of kstat_named__bindgen_ty_1"]
        [::std::mem::align_of::<kstat_named__bindgen_ty_1>() - 8usize];
    ["Offset of field: kstat_named__bindgen_ty_1::c"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, c) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::i32_"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, i32_) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::ui32"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, ui32) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, str_) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::i64_"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, i64_) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::ui64"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, ui64) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::l"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, l) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::ul"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, ul) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::ll"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, ll) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::ull"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, ull) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::f"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, f) - 0usize];
    ["Offset of field: kstat_named__bindgen_ty_1::d"]
        [::std::mem::offset_of!(kstat_named__bindgen_ty_1, d) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_named"][::std::mem::size_of::<kstat_named>() - 48usize];
    ["Alignment of kstat_named"][::std::mem::align_of::<kstat_named>() - 8usize];
    ["Offset of field: kstat_named::name"][::std::mem::offset_of!(kstat_named, name) - 0usize];
    ["Offset of field: kstat_named::data_type"]
        [::std::mem::offset_of!(kstat_named, data_type) - 31usize];
    ["Offset of field: kstat_named::value"][::std::mem::offset_of!(kstat_named, value) - 32usize];
};
pub type kstat_named_t = kstat_named;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kstat_intr {
    pub intrs: [uint_t; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_intr"][::std::mem::size_of::<kstat_intr>() - 20usize];
    ["Alignment of kstat_intr"][::std::mem::align_of::<kstat_intr>() - 4usize];
    ["Offset of field: kstat_intr::intrs"][::std::mem::offset_of!(kstat_intr, intrs) - 0usize];
};
pub type kstat_intr_t = kstat_intr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kstat_io {
    pub nread: u_longlong_t,
    pub nwritten: u_longlong_t,
    pub reads: uint_t,
    pub writes: uint_t,
    pub wtime: hrtime_t,
    pub wlentime: hrtime_t,
    pub wlastupdate: hrtime_t,
    pub rtime: hrtime_t,
    pub rlentime: hrtime_t,
    pub rlastupdate: hrtime_t,
    pub wcnt: uint_t,
    pub rcnt: uint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_io"][::std::mem::size_of::<kstat_io>() - 80usize];
    ["Alignment of kstat_io"][::std::mem::align_of::<kstat_io>() - 8usize];
    ["Offset of field: kstat_io::nread"][::std::mem::offset_of!(kstat_io, nread) - 0usize];
    ["Offset of field: kstat_io::nwritten"][::std::mem::offset_of!(kstat_io, nwritten) - 8usize];
    ["Offset of field: kstat_io::reads"][::std::mem::offset_of!(kstat_io, reads) - 16usize];
    ["Offset of field: kstat_io::writes"][::std::mem::offset_of!(kstat_io, writes) - 20usize];
    ["Offset of field: kstat_io::wtime"][::std::mem::offset_of!(kstat_io, wtime) - 24usize];
    ["Offset of field: kstat_io::wlentime"][::std::mem::offset_of!(kstat_io, wlentime) - 32usize];
    ["Offset of field: kstat_io::wlastupdate"]
        [::std::mem::offset_of!(kstat_io, wlastupdate) - 40usize];
    ["Offset of field: kstat_io::rtime"][::std::mem::offset_of!(kstat_io, rtime) - 48usize];
    ["Offset of field: kstat_io::rlentime"][::std::mem::offset_of!(kstat_io, rlentime) - 56usize];
    ["Offset of field: kstat_io::rlastupdate"]
        [::std::mem::offset_of!(kstat_io, rlastupdate) - 64usize];
    ["Offset of field: kstat_io::wcnt"][::std::mem::offset_of!(kstat_io, wcnt) - 72usize];
    ["Offset of field: kstat_io::rcnt"][::std::mem::offset_of!(kstat_io, rcnt) - 76usize];
};
pub type kstat_io_t = kstat_io;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kstat_timer {
    pub name: [::std::os::raw::c_char; 31usize],
    pub resv: uchar_t,
    pub num_events: u_longlong_t,
    pub elapsed_time: hrtime_t,
    pub min_time: hrtime_t,
    pub max_time: hrtime_t,
    pub start_time: hrtime_t,
    pub stop_time: hrtime_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kstat_timer"][::std::mem::size_of::<kstat_timer>() - 80usize];
    ["Alignment of kstat_timer"][::std::mem::align_of::<kstat_timer>() - 8usize];
    ["Offset of field: kstat_timer::name"][::std::mem::offset_of!(kstat_timer, name) - 0usize];
    ["Offset of field: kstat_timer::resv"][::std::mem::offset_of!(kstat_timer, resv) - 31usize];
    ["Offset of field: kstat_timer::num_events"]
        [::std::mem::offset_of!(kstat_timer, num_events) - 32usize];
    ["Offset of field: kstat_timer::elapsed_time"]
        [::std::mem::offset_of!(kstat_timer, elapsed_time) - 40usize];
    ["Offset of field: kstat_timer::min_time"]
        [::std::mem::offset_of!(kstat_timer, min_time) - 48usize];
    ["Offset of field: kstat_timer::max_time"]
        [::std::mem::offset_of!(kstat_timer, max_time) - 56usize];
    ["Offset of field: kstat_timer::start_time"]
        [::std::mem::offset_of!(kstat_timer, start_time) - 64usize];
    ["Offset of field: kstat_timer::stop_time"]
        [::std::mem::offset_of!(kstat_timer, stop_time) - 72usize];
};
pub type kstat_timer_t = kstat_timer;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct buf {
    pub b_flags: ::std::os::raw::c_int,
    pub b_forw: *mut buf,
    pub b_back: *mut buf,
    pub av_forw: *mut buf,
    pub av_back: *mut buf,
    pub b_dev: o_dev_t,
    pub b_bcount: usize,
    pub b_un: buf__bindgen_ty_1,
    pub _b_blkno: lldaddr_t,
    pub b_obs1: ::std::os::raw::c_char,
    pub b_resid: usize,
    pub b_start: clock_t,
    pub b_proc: *mut proc_,
    pub b_pages: *mut page,
    pub b_obs2: clock_t,
    pub b_bufsize: usize,
    pub b_iodone:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut buf) -> ::std::os::raw::c_int>,
    pub b_vp: *mut vnode,
    pub b_chain: *mut buf,
    pub b_obs3: ::std::os::raw::c_int,
    pub b_error: ::std::os::raw::c_int,
    pub b_private: *mut ::std::os::raw::c_void,
    pub b_edev: dev_t,
    pub b_sem: ksema_t,
    pub b_io: ksema_t,
    pub b_list: *mut buf,
    pub b_shadow: *mut *mut page,
    pub b_dip: *mut ::std::os::raw::c_void,
    pub b_file: *mut vnode,
    pub b_offset: offset_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union buf__bindgen_ty_1 {
    pub b_addr: caddr_t,
    pub b_fs: *mut fs,
    pub b_cg: *mut cg,
    pub b_dino: *mut dinode,
    pub b_daddr: *mut daddr32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of buf__bindgen_ty_1"][::std::mem::size_of::<buf__bindgen_ty_1>() - 8usize];
    ["Alignment of buf__bindgen_ty_1"][::std::mem::align_of::<buf__bindgen_ty_1>() - 8usize];
    ["Offset of field: buf__bindgen_ty_1::b_addr"]
        [::std::mem::offset_of!(buf__bindgen_ty_1, b_addr) - 0usize];
    ["Offset of field: buf__bindgen_ty_1::b_fs"]
        [::std::mem::offset_of!(buf__bindgen_ty_1, b_fs) - 0usize];
    ["Offset of field: buf__bindgen_ty_1::b_cg"]
        [::std::mem::offset_of!(buf__bindgen_ty_1, b_cg) - 0usize];
    ["Offset of field: buf__bindgen_ty_1::b_dino"]
        [::std::mem::offset_of!(buf__bindgen_ty_1, b_dino) - 0usize];
    ["Offset of field: buf__bindgen_ty_1::b_daddr"]
        [::std::mem::offset_of!(buf__bindgen_ty_1, b_daddr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of buf"][::std::mem::size_of::<buf>() - 248usize];
    ["Alignment of buf"][::std::mem::align_of::<buf>() - 8usize];
    ["Offset of field: buf::b_flags"][::std::mem::offset_of!(buf, b_flags) - 0usize];
    ["Offset of field: buf::b_forw"][::std::mem::offset_of!(buf, b_forw) - 8usize];
    ["Offset of field: buf::b_back"][::std::mem::offset_of!(buf, b_back) - 16usize];
    ["Offset of field: buf::av_forw"][::std::mem::offset_of!(buf, av_forw) - 24usize];
    ["Offset of field: buf::av_back"][::std::mem::offset_of!(buf, av_back) - 32usize];
    ["Offset of field: buf::b_dev"][::std::mem::offset_of!(buf, b_dev) - 40usize];
    ["Offset of field: buf::b_bcount"][::std::mem::offset_of!(buf, b_bcount) - 48usize];
    ["Offset of field: buf::b_un"][::std::mem::offset_of!(buf, b_un) - 56usize];
    ["Offset of field: buf::_b_blkno"][::std::mem::offset_of!(buf, _b_blkno) - 64usize];
    ["Offset of field: buf::b_obs1"][::std::mem::offset_of!(buf, b_obs1) - 72usize];
    ["Offset of field: buf::b_resid"][::std::mem::offset_of!(buf, b_resid) - 80usize];
    ["Offset of field: buf::b_start"][::std::mem::offset_of!(buf, b_start) - 88usize];
    ["Offset of field: buf::b_proc"][::std::mem::offset_of!(buf, b_proc) - 96usize];
    ["Offset of field: buf::b_pages"][::std::mem::offset_of!(buf, b_pages) - 104usize];
    ["Offset of field: buf::b_obs2"][::std::mem::offset_of!(buf, b_obs2) - 112usize];
    ["Offset of field: buf::b_bufsize"][::std::mem::offset_of!(buf, b_bufsize) - 120usize];
    ["Offset of field: buf::b_iodone"][::std::mem::offset_of!(buf, b_iodone) - 128usize];
    ["Offset of field: buf::b_vp"][::std::mem::offset_of!(buf, b_vp) - 136usize];
    ["Offset of field: buf::b_chain"][::std::mem::offset_of!(buf, b_chain) - 144usize];
    ["Offset of field: buf::b_obs3"][::std::mem::offset_of!(buf, b_obs3) - 152usize];
    ["Offset of field: buf::b_error"][::std::mem::offset_of!(buf, b_error) - 156usize];
    ["Offset of field: buf::b_private"][::std::mem::offset_of!(buf, b_private) - 160usize];
    ["Offset of field: buf::b_edev"][::std::mem::offset_of!(buf, b_edev) - 168usize];
    ["Offset of field: buf::b_sem"][::std::mem::offset_of!(buf, b_sem) - 176usize];
    ["Offset of field: buf::b_io"][::std::mem::offset_of!(buf, b_io) - 192usize];
    ["Offset of field: buf::b_list"][::std::mem::offset_of!(buf, b_list) - 208usize];
    ["Offset of field: buf::b_shadow"][::std::mem::offset_of!(buf, b_shadow) - 216usize];
    ["Offset of field: buf::b_dip"][::std::mem::offset_of!(buf, b_dip) - 224usize];
    ["Offset of field: buf::b_file"][::std::mem::offset_of!(buf, b_file) - 232usize];
    ["Offset of field: buf::b_offset"][::std::mem::offset_of!(buf, b_offset) - 240usize];
};
pub type buf_t = buf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct diskhd {
    pub b_flags: ::std::os::raw::c_int,
    pub b_forw: *mut buf,
    pub b_back: *mut buf,
    pub av_forw: *mut buf,
    pub av_back: *mut buf,
    pub b_dev: o_dev_t,
    pub b_bcount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of diskhd"][::std::mem::size_of::<diskhd>() - 56usize];
    ["Alignment of diskhd"][::std::mem::align_of::<diskhd>() - 8usize];
    ["Offset of field: diskhd::b_flags"][::std::mem::offset_of!(diskhd, b_flags) - 0usize];
    ["Offset of field: diskhd::b_forw"][::std::mem::offset_of!(diskhd, b_forw) - 8usize];
    ["Offset of field: diskhd::b_back"][::std::mem::offset_of!(diskhd, b_back) - 16usize];
    ["Offset of field: diskhd::av_forw"][::std::mem::offset_of!(diskhd, av_forw) - 24usize];
    ["Offset of field: diskhd::av_back"][::std::mem::offset_of!(diskhd, av_back) - 32usize];
    ["Offset of field: diskhd::b_dev"][::std::mem::offset_of!(diskhd, b_dev) - 40usize];
    ["Offset of field: diskhd::b_bcount"][::std::mem::offset_of!(diskhd, b_bcount) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct biostats {
    pub bio_lookup: kstat_named_t,
    pub bio_hit: kstat_named_t,
    pub bio_bufwant: kstat_named_t,
    pub bio_bufwait: kstat_named_t,
    pub bio_bufbusy: kstat_named_t,
    pub bio_bufdup: kstat_named_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of biostats"][::std::mem::size_of::<biostats>() - 288usize];
    ["Alignment of biostats"][::std::mem::align_of::<biostats>() - 8usize];
    ["Offset of field: biostats::bio_lookup"]
        [::std::mem::offset_of!(biostats, bio_lookup) - 0usize];
    ["Offset of field: biostats::bio_hit"][::std::mem::offset_of!(biostats, bio_hit) - 48usize];
    ["Offset of field: biostats::bio_bufwant"]
        [::std::mem::offset_of!(biostats, bio_bufwant) - 96usize];
    ["Offset of field: biostats::bio_bufwait"]
        [::std::mem::offset_of!(biostats, bio_bufwait) - 144usize];
    ["Offset of field: biostats::bio_bufbusy"]
        [::std::mem::offset_of!(biostats, bio_bufbusy) - 192usize];
    ["Offset of field: biostats::bio_bufdup"]
        [::std::mem::offset_of!(biostats, bio_bufdup) - 240usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hbuf {
    pub b_flags: ::std::os::raw::c_int,
    pub b_forw: *mut buf,
    pub b_back: *mut buf,
    pub av_forw: *mut buf,
    pub av_back: *mut buf,
    pub b_length: ::std::os::raw::c_int,
    pub b_lock: kmutex_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hbuf"][::std::mem::size_of::<hbuf>() - 56usize];
    ["Alignment of hbuf"][::std::mem::align_of::<hbuf>() - 8usize];
    ["Offset of field: hbuf::b_flags"][::std::mem::offset_of!(hbuf, b_flags) - 0usize];
    ["Offset of field: hbuf::b_forw"][::std::mem::offset_of!(hbuf, b_forw) - 8usize];
    ["Offset of field: hbuf::b_back"][::std::mem::offset_of!(hbuf, b_back) - 16usize];
    ["Offset of field: hbuf::av_forw"][::std::mem::offset_of!(hbuf, av_forw) - 24usize];
    ["Offset of field: hbuf::av_back"][::std::mem::offset_of!(hbuf, av_back) - 32usize];
    ["Offset of field: hbuf::b_length"][::std::mem::offset_of!(hbuf, b_length) - 40usize];
    ["Offset of field: hbuf::b_lock"][::std::mem::offset_of!(hbuf, b_lock) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dwbuf {
    pub b_flags: ::std::os::raw::c_int,
    pub b_forw: *mut buf,
    pub b_back: *mut buf,
    pub av_forw: *mut buf,
    pub av_back: *mut buf,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dwbuf"][::std::mem::size_of::<dwbuf>() - 40usize];
    ["Alignment of dwbuf"][::std::mem::align_of::<dwbuf>() - 8usize];
    ["Offset of field: dwbuf::b_flags"][::std::mem::offset_of!(dwbuf, b_flags) - 0usize];
    ["Offset of field: dwbuf::b_forw"][::std::mem::offset_of!(dwbuf, b_forw) - 8usize];
    ["Offset of field: dwbuf::b_back"][::std::mem::offset_of!(dwbuf, b_back) - 16usize];
    ["Offset of field: dwbuf::av_forw"][::std::mem::offset_of!(dwbuf, av_forw) - 24usize];
    ["Offset of field: dwbuf::av_back"][::std::mem::offset_of!(dwbuf, av_back) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pollfd {
    pub fd: ::std::os::raw::c_int,
    pub events: ::std::os::raw::c_short,
    pub revents: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pollfd"][::std::mem::size_of::<pollfd>() - 8usize];
    ["Alignment of pollfd"][::std::mem::align_of::<pollfd>() - 4usize];
    ["Offset of field: pollfd::fd"][::std::mem::offset_of!(pollfd, fd) - 0usize];
    ["Offset of field: pollfd::events"][::std::mem::offset_of!(pollfd, events) - 4usize];
    ["Offset of field: pollfd::revents"][::std::mem::offset_of!(pollfd, revents) - 6usize];
};
pub type pollfd_t = pollfd;
pub type nfds_t = ::std::os::raw::c_ulong;
unsafe extern "C" {
    pub fn poll(
        arg1: *mut pollfd,
        arg2: nfds_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub const fault_type_F_INVAL: fault_type = 0;
pub const fault_type_F_PROT: fault_type = 1;
pub const fault_type_F_SOFTLOCK: fault_type = 2;
pub const fault_type_F_SOFTUNLOCK: fault_type = 3;
pub type fault_type = ::std::os::raw::c_uint;
pub const lock_type_L_PAGELOCK: lock_type = 0;
pub const lock_type_L_PAGEUNLOCK: lock_type = 1;
pub type lock_type = ::std::os::raw::c_uint;
pub const seg_rw_S_OTHER: seg_rw = 0;
pub const seg_rw_S_READ: seg_rw = 1;
pub const seg_rw_S_WRITE: seg_rw = 2;
pub const seg_rw_S_EXEC: seg_rw = 3;
pub const seg_rw_S_CREATE: seg_rw = 4;
pub const seg_rw_S_READ_NOCOW: seg_rw = 5;
pub type seg_rw = ::std::os::raw::c_uint;
pub const segcapability_t_S_CAPABILITY_NOMINFLT: segcapability_t = 0;
pub type segcapability_t = ::std::os::raw::c_uint;
pub type faultcode_t = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn fc_decode(arg1: faultcode_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_pad: ::std::os::raw::c_int,
    pub __data: siginfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo__bindgen_ty_1 {
    pub __pad: [::std::os::raw::c_int; 60usize],
    pub __proc: siginfo__bindgen_ty_1__bindgen_ty_1,
    pub __fault: siginfo__bindgen_ty_1__bindgen_ty_2,
    pub __file: siginfo__bindgen_ty_1__bindgen_ty_3,
    pub __prof: siginfo__bindgen_ty_1__bindgen_ty_4,
    pub __rctl: siginfo__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_1 {
    pub __pid: pid_t,
    pub __pdata: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __ctid: ctid_t,
    pub __zoneid: zoneid_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __kill: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __cld: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __uid: uid_t,
    pub __value: sigval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__uid"][::std::mem::offset_of!(
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __uid
    )
        - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__value"][::std::mem::offset_of!(
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __value
    )
        - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub __utime: clock_t,
    pub __status: ::std::os::raw::c_int,
    pub __stime: clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"][::std::mem::size_of::<
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
    >() - 24usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>()
            - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__utime"][::std::mem::offset_of!(
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        __utime
    )
        - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__status"] [:: std :: mem :: offset_of ! (siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , __status) - 8usize] ;
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__stime"][::std::mem::offset_of!(
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        __stime
    )
        - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__kill"][::std::mem::offset_of!(
        siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __kill
    ) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__cld"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1, __cld) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo__bindgen_ty_1__bindgen_ty_1>() - 40usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1::__pid"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_1, __pid) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1::__pdata"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_1, __pdata) - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1::__ctid"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_1, __ctid) - 32usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_1::__zoneid"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_1, __zoneid) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_2 {
    pub __addr: *mut ::std::os::raw::c_void,
    pub __trapno: ::std::os::raw::c_int,
    pub __pc: caddr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<siginfo__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_2::__addr"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_2, __addr) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_2::__trapno"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_2, __trapno) - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_2::__pc"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_2, __pc) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_3 {
    pub __fd: ::std::os::raw::c_int,
    pub __band: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<siginfo__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_3::__fd"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_3, __fd) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_3::__band"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_3, __band) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_4 {
    pub __faddr: caddr_t,
    pub __tstamp: timestruc_t,
    pub __syscall: ::std::os::raw::c_short,
    pub __nsysarg: ::std::os::raw::c_char,
    pub __fault: ::std::os::raw::c_char,
    pub __sysarg: [::std::os::raw::c_long; 8usize],
    pub __mstate: [::std::os::raw::c_int; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<siginfo__bindgen_ty_1__bindgen_ty_4>() - 136usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__faddr"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __faddr) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__tstamp"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __tstamp) - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__syscall"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __syscall) - 24usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__nsysarg"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __nsysarg) - 26usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__fault"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __fault) - 27usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__sysarg"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __sysarg) - 32usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_4::__mstate"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_4, __mstate) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo__bindgen_ty_1__bindgen_ty_5 {
    pub __entity: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<siginfo__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Alignment of siginfo__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: siginfo__bindgen_ty_1__bindgen_ty_5::__entity"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1__bindgen_ty_5, __entity) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo__bindgen_ty_1"][::std::mem::size_of::<siginfo__bindgen_ty_1>() - 240usize];
    ["Alignment of siginfo__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo__bindgen_ty_1::__pad"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1, __pad) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1::__proc"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1, __proc) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1::__fault"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1, __fault) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1::__file"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1, __file) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1::__prof"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1, __prof) - 0usize];
    ["Offset of field: siginfo__bindgen_ty_1::__rctl"]
        [::std::mem::offset_of!(siginfo__bindgen_ty_1, __rctl) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo"][::std::mem::size_of::<siginfo>() - 256usize];
    ["Alignment of siginfo"][::std::mem::align_of::<siginfo>() - 8usize];
    ["Offset of field: siginfo::si_signo"][::std::mem::offset_of!(siginfo, si_signo) - 0usize];
    ["Offset of field: siginfo::si_code"][::std::mem::offset_of!(siginfo, si_code) - 4usize];
    ["Offset of field: siginfo::si_errno"][::std::mem::offset_of!(siginfo, si_errno) - 8usize];
    ["Offset of field: siginfo::si_pad"][::std::mem::offset_of!(siginfo, si_pad) - 12usize];
    ["Offset of field: siginfo::__data"][::std::mem::offset_of!(siginfo, __data) - 16usize];
};
pub type siginfo_t = siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_pad: ::std::os::raw::c_int,
    pub __data: k_siginfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union k_siginfo__bindgen_ty_1 {
    pub __proc: k_siginfo__bindgen_ty_1__bindgen_ty_1,
    pub __fault: k_siginfo__bindgen_ty_1__bindgen_ty_2,
    pub __file: k_siginfo__bindgen_ty_1__bindgen_ty_3,
    pub __prof: k_siginfo__bindgen_ty_1__bindgen_ty_4,
    pub __rctl: k_siginfo__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_1 {
    pub __pid: pid_t,
    pub __pdata: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __ctid: ctid_t,
    pub __zoneid: zoneid_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __kill: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __cld: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __uid: uid_t,
    pub __value: sigval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
        ) - 16usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__uid"][::std::mem::offset_of!(
        k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __uid
    )
        - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__value"] [:: std :: mem :: offset_of ! (k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 , __value) - 8usize] ;
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub __utime: clock_t,
    pub __status: ::std::os::raw::c_int,
    pub __stime: clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
        ) - 24usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
        ) - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__utime"] [:: std :: mem :: offset_of ! (k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , __utime) - 0usize] ;
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__status"] [:: std :: mem :: offset_of ! (k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , __status) - 8usize] ;
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__stime"] [:: std :: mem :: offset_of ! (k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , __stime) - 16usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__kill"][::std::mem::offset_of!(
        k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __kill
    ) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__cld"][::std::mem::offset_of!(
        k_siginfo__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __cld
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1>() - 40usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1::__pid"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_1, __pid) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1::__pdata"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_1, __pdata) - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1::__ctid"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_1, __ctid) - 32usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_1::__zoneid"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_1, __zoneid) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_2 {
    pub __addr: *mut ::std::os::raw::c_void,
    pub __trapno: ::std::os::raw::c_int,
    pub __pc: caddr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_2::__addr"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_2, __addr) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_2::__trapno"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_2, __trapno) - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_2::__pc"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_2, __pc) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_3 {
    pub __fd: ::std::os::raw::c_int,
    pub __band: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_3::__fd"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_3, __fd) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_3::__band"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_3, __band) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_4 {
    pub __faddr: caddr_t,
    pub __tstamp: timestruc_t,
    pub __syscall: ::std::os::raw::c_short,
    pub __nsysarg: ::std::os::raw::c_char,
    pub __fault: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_4>() - 32usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_4::__faddr"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_4, __faddr) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_4::__tstamp"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_4, __tstamp) - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_4::__syscall"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_4, __syscall) - 24usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_4::__nsysarg"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_4, __nsysarg) - 26usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_4::__fault"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_4, __fault) - 27usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_siginfo__bindgen_ty_1__bindgen_ty_5 {
    pub __entity: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<k_siginfo__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Alignment of k_siginfo__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: k_siginfo__bindgen_ty_1__bindgen_ty_5::__entity"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1__bindgen_ty_5, __entity) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo__bindgen_ty_1"][::std::mem::size_of::<k_siginfo__bindgen_ty_1>() - 40usize];
    ["Alignment of k_siginfo__bindgen_ty_1"]
        [::std::mem::align_of::<k_siginfo__bindgen_ty_1>() - 8usize];
    ["Offset of field: k_siginfo__bindgen_ty_1::__proc"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1, __proc) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1::__fault"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1, __fault) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1::__file"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1, __file) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1::__prof"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1, __prof) - 0usize];
    ["Offset of field: k_siginfo__bindgen_ty_1::__rctl"]
        [::std::mem::offset_of!(k_siginfo__bindgen_ty_1, __rctl) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_siginfo"][::std::mem::size_of::<k_siginfo>() - 56usize];
    ["Alignment of k_siginfo"][::std::mem::align_of::<k_siginfo>() - 8usize];
    ["Offset of field: k_siginfo::si_signo"][::std::mem::offset_of!(k_siginfo, si_signo) - 0usize];
    ["Offset of field: k_siginfo::si_code"][::std::mem::offset_of!(k_siginfo, si_code) - 4usize];
    ["Offset of field: k_siginfo::si_errno"][::std::mem::offset_of!(k_siginfo, si_errno) - 8usize];
    ["Offset of field: k_siginfo::si_pad"][::std::mem::offset_of!(k_siginfo, si_pad) - 12usize];
    ["Offset of field: k_siginfo::__data"][::std::mem::offset_of!(k_siginfo, __data) - 16usize];
};
pub type k_siginfo_t = k_siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigqueue {
    pub sq_next: *mut sigqueue,
    pub sq_info: k_siginfo_t,
    pub sq_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut sigqueue)>,
    pub sq_backptr: *mut ::std::os::raw::c_void,
    pub sq_external: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigqueue"][::std::mem::size_of::<sigqueue>() - 88usize];
    ["Alignment of sigqueue"][::std::mem::align_of::<sigqueue>() - 8usize];
    ["Offset of field: sigqueue::sq_next"][::std::mem::offset_of!(sigqueue, sq_next) - 0usize];
    ["Offset of field: sigqueue::sq_info"][::std::mem::offset_of!(sigqueue, sq_info) - 8usize];
    ["Offset of field: sigqueue::sq_func"][::std::mem::offset_of!(sigqueue, sq_func) - 64usize];
    ["Offset of field: sigqueue::sq_backptr"]
        [::std::mem::offset_of!(sigqueue, sq_backptr) - 72usize];
    ["Offset of field: sigqueue::sq_external"]
        [::std::mem::offset_of!(sigqueue, sq_external) - 80usize];
};
pub type sigqueue_t = sigqueue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_sigset_t {
    pub __sigbits: [::std::os::raw::c_uint; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of k_sigset_t"][::std::mem::size_of::<k_sigset_t>() - 12usize];
    ["Alignment of k_sigset_t"][::std::mem::align_of::<k_sigset_t>() - 4usize];
    ["Offset of field: k_sigset_t::__sigbits"]
        [::std::mem::offset_of!(k_sigset_t, __sigbits) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub sa_flags: ::std::os::raw::c_int,
    pub _funcptr: sigaction__bindgen_ty_1,
    pub sa_mask: sigset_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 {
    pub _handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub _sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut siginfo_t,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction__bindgen_ty_1"][::std::mem::size_of::<sigaction__bindgen_ty_1>() - 8usize];
    ["Alignment of sigaction__bindgen_ty_1"]
        [::std::mem::align_of::<sigaction__bindgen_ty_1>() - 8usize];
    ["Offset of field: sigaction__bindgen_ty_1::_handler"]
        [::std::mem::offset_of!(sigaction__bindgen_ty_1, _handler) - 0usize];
    ["Offset of field: sigaction__bindgen_ty_1::_sigaction"]
        [::std::mem::offset_of!(sigaction__bindgen_ty_1, _sigaction) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 32usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::sa_flags"][::std::mem::offset_of!(sigaction, sa_flags) - 0usize];
    ["Offset of field: sigaction::_funcptr"][::std::mem::offset_of!(sigaction, _funcptr) - 8usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_size: usize,
    pub ss_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaltstack"][::std::mem::size_of::<sigaltstack>() - 24usize];
    ["Alignment of sigaltstack"][::std::mem::align_of::<sigaltstack>() - 8usize];
    ["Offset of field: sigaltstack::ss_sp"][::std::mem::offset_of!(sigaltstack, ss_sp) - 0usize];
    ["Offset of field: sigaltstack::ss_size"]
        [::std::mem::offset_of!(sigaltstack, ss_size) - 8usize];
    ["Offset of field: sigaltstack::ss_flags"]
        [::std::mem::offset_of!(sigaltstack, ss_flags) - 16usize];
};
pub type stack_t = sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct signotify_id {
    pub sn_pid: pid_t,
    pub sn_index: ::std::os::raw::c_int,
    pub sn_pad: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of signotify_id"][::std::mem::size_of::<signotify_id>() - 12usize];
    ["Alignment of signotify_id"][::std::mem::align_of::<signotify_id>() - 4usize];
    ["Offset of field: signotify_id::sn_pid"]
        [::std::mem::offset_of!(signotify_id, sn_pid) - 0usize];
    ["Offset of field: signotify_id::sn_index"]
        [::std::mem::offset_of!(signotify_id, sn_index) - 4usize];
    ["Offset of field: signotify_id::sn_pad"]
        [::std::mem::offset_of!(signotify_id, sn_pad) - 8usize];
};
pub type signotify_id_t = signotify_id;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 16usize];
    ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 8usize];
    ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
    ["Offset of field: sigstack::ss_onstack"]
        [::std::mem::offset_of!(sigstack, ss_onstack) - 8usize];
};
pub type greg_t = ::std::os::raw::c_long;
pub type gregset_t = [greg_t; 28usize];
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _fpu {
    pub fp_reg_set: _fpu__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union _fpu__bindgen_ty_1 {
    pub fpchip_state: _fpu__bindgen_ty_1__fpchip_state,
    pub f_fpregs: [u32; 130usize],
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _fpu__bindgen_ty_1__fpchip_state {
    pub cw: u16,
    pub sw: u16,
    pub fctw: u8,
    pub __fx_rsvd: u8,
    pub fop: u16,
    pub rip: u64,
    pub rdp: u64,
    pub mxcsr: u32,
    pub mxcsr_mask: u32,
    pub st: [_fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1; 8usize],
    pub xmm: [upad128_t; 16usize],
    pub __fx_ign2: [upad128_t; 6usize],
    pub status: u32,
    pub xstatus: u32,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union _fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1 {
    pub fpr_16: [u16; 5usize],
    pub __fpr_pad: upad128_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1"]
        [::std::mem::size_of::<_fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1>() - 16usize];
    ["Alignment of _fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1"]
        [::std::mem::align_of::<_fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1>() - 16usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1::fpr_16"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1, fpr_16) - 0usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1::__fpr_pad"][::std::mem::offset_of!(
        _fpu__bindgen_ty_1__fpchip_state__bindgen_ty_1,
        __fpr_pad
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpu__bindgen_ty_1__fpchip_state"]
        [::std::mem::size_of::<_fpu__bindgen_ty_1__fpchip_state>() - 528usize];
    ["Alignment of _fpu__bindgen_ty_1__fpchip_state"]
        [::std::mem::align_of::<_fpu__bindgen_ty_1__fpchip_state>() - 16usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::cw"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, cw) - 0usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::sw"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, sw) - 2usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::fctw"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, fctw) - 4usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::__fx_rsvd"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, __fx_rsvd) - 5usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::fop"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, fop) - 6usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::rip"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, rip) - 8usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::rdp"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, rdp) - 16usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::mxcsr"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, mxcsr) - 24usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::mxcsr_mask"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, mxcsr_mask) - 28usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::st"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, st) - 32usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::xmm"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, xmm) - 160usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::__fx_ign2"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, __fx_ign2) - 416usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::status"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, status) - 512usize];
    ["Offset of field: _fpu__bindgen_ty_1__fpchip_state::xstatus"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1__fpchip_state, xstatus) - 516usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpu__bindgen_ty_1"][::std::mem::size_of::<_fpu__bindgen_ty_1>() - 528usize];
    ["Alignment of _fpu__bindgen_ty_1"][::std::mem::align_of::<_fpu__bindgen_ty_1>() - 16usize];
    ["Offset of field: _fpu__bindgen_ty_1::fpchip_state"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1, fpchip_state) - 0usize];
    ["Offset of field: _fpu__bindgen_ty_1::f_fpregs"]
        [::std::mem::offset_of!(_fpu__bindgen_ty_1, f_fpregs) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpu"][::std::mem::size_of::<_fpu>() - 528usize];
    ["Alignment of _fpu"][::std::mem::align_of::<_fpu>() - 16usize];
    ["Offset of field: _fpu::fp_reg_set"][::std::mem::offset_of!(_fpu, fp_reg_set) - 0usize];
};
pub type fpregset_t = _fpu;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct mcontext_t {
    pub gregs: gregset_t,
    pub fpregs: fpregset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mcontext_t"][::std::mem::size_of::<mcontext_t>() - 752usize];
    ["Alignment of mcontext_t"][::std::mem::align_of::<mcontext_t>() - 16usize];
    ["Offset of field: mcontext_t::gregs"][::std::mem::offset_of!(mcontext_t, gregs) - 0usize];
    ["Offset of field: mcontext_t::fpregs"][::std::mem::offset_of!(mcontext_t, fpregs) - 224usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dbregset {
    pub debugreg: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dbregset"][::std::mem::size_of::<dbregset>() - 128usize];
    ["Alignment of dbregset"][::std::mem::align_of::<dbregset>() - 8usize];
    ["Offset of field: dbregset::debugreg"][::std::mem::offset_of!(dbregset, debugreg) - 0usize];
};
pub type dbregset_t = dbregset;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct tss64 {
    pub tss_rsvd0: u32,
    pub tss_rsp0: u64,
    pub tss_rsp1: u64,
    pub tss_rsp2: u64,
    pub tss_rsvd1: u64,
    pub tss_ist1: u64,
    pub tss_ist2: u64,
    pub tss_ist3: u64,
    pub tss_ist4: u64,
    pub tss_ist5: u64,
    pub tss_ist6: u64,
    pub tss_ist7: u64,
    pub tss_rsvd2: u64,
    pub tss_rsvd3: u16,
    pub tss_bitmapbase: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tss64"][::std::mem::size_of::<tss64>() - 104usize];
    ["Alignment of tss64"][::std::mem::align_of::<tss64>() - 4usize];
    ["Offset of field: tss64::tss_rsvd0"][::std::mem::offset_of!(tss64, tss_rsvd0) - 0usize];
    ["Offset of field: tss64::tss_rsp0"][::std::mem::offset_of!(tss64, tss_rsp0) - 4usize];
    ["Offset of field: tss64::tss_rsp1"][::std::mem::offset_of!(tss64, tss_rsp1) - 12usize];
    ["Offset of field: tss64::tss_rsp2"][::std::mem::offset_of!(tss64, tss_rsp2) - 20usize];
    ["Offset of field: tss64::tss_rsvd1"][::std::mem::offset_of!(tss64, tss_rsvd1) - 28usize];
    ["Offset of field: tss64::tss_ist1"][::std::mem::offset_of!(tss64, tss_ist1) - 36usize];
    ["Offset of field: tss64::tss_ist2"][::std::mem::offset_of!(tss64, tss_ist2) - 44usize];
    ["Offset of field: tss64::tss_ist3"][::std::mem::offset_of!(tss64, tss_ist3) - 52usize];
    ["Offset of field: tss64::tss_ist4"][::std::mem::offset_of!(tss64, tss_ist4) - 60usize];
    ["Offset of field: tss64::tss_ist5"][::std::mem::offset_of!(tss64, tss_ist5) - 68usize];
    ["Offset of field: tss64::tss_ist6"][::std::mem::offset_of!(tss64, tss_ist6) - 76usize];
    ["Offset of field: tss64::tss_ist7"][::std::mem::offset_of!(tss64, tss_ist7) - 84usize];
    ["Offset of field: tss64::tss_rsvd2"][::std::mem::offset_of!(tss64, tss_rsvd2) - 92usize];
    ["Offset of field: tss64::tss_rsvd3"][::std::mem::offset_of!(tss64, tss_rsvd3) - 100usize];
    ["Offset of field: tss64::tss_bitmapbase"]
        [::std::mem::offset_of!(tss64, tss_bitmapbase) - 102usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tss32 {
    pub tss_link: u16,
    pub tss_rsvd0: u16,
    pub tss_esp0: u32,
    pub tss_ss0: u16,
    pub tss_rsvd1: u16,
    pub tss_esp1: u32,
    pub tss_ss1: u16,
    pub tss_rsvd2: u16,
    pub tss_esp2: u32,
    pub tss_ss2: u16,
    pub tss_rsvd3: u16,
    pub tss_cr3: u32,
    pub tss_eip: u32,
    pub tss_eflags: u32,
    pub tss_eax: u32,
    pub tss_ecx: u32,
    pub tss_edx: u32,
    pub tss_ebx: u32,
    pub tss_esp: u32,
    pub tss_ebp: u32,
    pub tss_esi: u32,
    pub tss_edi: u32,
    pub tss_es: u16,
    pub tss_rsvd4: u16,
    pub tss_cs: u16,
    pub tss_rsvd5: u16,
    pub tss_ss: u16,
    pub tss_rsvd6: u16,
    pub tss_ds: u16,
    pub tss_rsvd7: u16,
    pub tss_fs: u16,
    pub tss_rsvd8: u16,
    pub tss_gs: u16,
    pub tss_rsvd9: u16,
    pub tss_ldt: u16,
    pub tss_rsvd10: u16,
    pub tss_rsvd11: u16,
    pub tss_bitmapbase: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tss32"][::std::mem::size_of::<tss32>() - 104usize];
    ["Alignment of tss32"][::std::mem::align_of::<tss32>() - 4usize];
    ["Offset of field: tss32::tss_link"][::std::mem::offset_of!(tss32, tss_link) - 0usize];
    ["Offset of field: tss32::tss_rsvd0"][::std::mem::offset_of!(tss32, tss_rsvd0) - 2usize];
    ["Offset of field: tss32::tss_esp0"][::std::mem::offset_of!(tss32, tss_esp0) - 4usize];
    ["Offset of field: tss32::tss_ss0"][::std::mem::offset_of!(tss32, tss_ss0) - 8usize];
    ["Offset of field: tss32::tss_rsvd1"][::std::mem::offset_of!(tss32, tss_rsvd1) - 10usize];
    ["Offset of field: tss32::tss_esp1"][::std::mem::offset_of!(tss32, tss_esp1) - 12usize];
    ["Offset of field: tss32::tss_ss1"][::std::mem::offset_of!(tss32, tss_ss1) - 16usize];
    ["Offset of field: tss32::tss_rsvd2"][::std::mem::offset_of!(tss32, tss_rsvd2) - 18usize];
    ["Offset of field: tss32::tss_esp2"][::std::mem::offset_of!(tss32, tss_esp2) - 20usize];
    ["Offset of field: tss32::tss_ss2"][::std::mem::offset_of!(tss32, tss_ss2) - 24usize];
    ["Offset of field: tss32::tss_rsvd3"][::std::mem::offset_of!(tss32, tss_rsvd3) - 26usize];
    ["Offset of field: tss32::tss_cr3"][::std::mem::offset_of!(tss32, tss_cr3) - 28usize];
    ["Offset of field: tss32::tss_eip"][::std::mem::offset_of!(tss32, tss_eip) - 32usize];
    ["Offset of field: tss32::tss_eflags"][::std::mem::offset_of!(tss32, tss_eflags) - 36usize];
    ["Offset of field: tss32::tss_eax"][::std::mem::offset_of!(tss32, tss_eax) - 40usize];
    ["Offset of field: tss32::tss_ecx"][::std::mem::offset_of!(tss32, tss_ecx) - 44usize];
    ["Offset of field: tss32::tss_edx"][::std::mem::offset_of!(tss32, tss_edx) - 48usize];
    ["Offset of field: tss32::tss_ebx"][::std::mem::offset_of!(tss32, tss_ebx) - 52usize];
    ["Offset of field: tss32::tss_esp"][::std::mem::offset_of!(tss32, tss_esp) - 56usize];
    ["Offset of field: tss32::tss_ebp"][::std::mem::offset_of!(tss32, tss_ebp) - 60usize];
    ["Offset of field: tss32::tss_esi"][::std::mem::offset_of!(tss32, tss_esi) - 64usize];
    ["Offset of field: tss32::tss_edi"][::std::mem::offset_of!(tss32, tss_edi) - 68usize];
    ["Offset of field: tss32::tss_es"][::std::mem::offset_of!(tss32, tss_es) - 72usize];
    ["Offset of field: tss32::tss_rsvd4"][::std::mem::offset_of!(tss32, tss_rsvd4) - 74usize];
    ["Offset of field: tss32::tss_cs"][::std::mem::offset_of!(tss32, tss_cs) - 76usize];
    ["Offset of field: tss32::tss_rsvd5"][::std::mem::offset_of!(tss32, tss_rsvd5) - 78usize];
    ["Offset of field: tss32::tss_ss"][::std::mem::offset_of!(tss32, tss_ss) - 80usize];
    ["Offset of field: tss32::tss_rsvd6"][::std::mem::offset_of!(tss32, tss_rsvd6) - 82usize];
    ["Offset of field: tss32::tss_ds"][::std::mem::offset_of!(tss32, tss_ds) - 84usize];
    ["Offset of field: tss32::tss_rsvd7"][::std::mem::offset_of!(tss32, tss_rsvd7) - 86usize];
    ["Offset of field: tss32::tss_fs"][::std::mem::offset_of!(tss32, tss_fs) - 88usize];
    ["Offset of field: tss32::tss_rsvd8"][::std::mem::offset_of!(tss32, tss_rsvd8) - 90usize];
    ["Offset of field: tss32::tss_gs"][::std::mem::offset_of!(tss32, tss_gs) - 92usize];
    ["Offset of field: tss32::tss_rsvd9"][::std::mem::offset_of!(tss32, tss_rsvd9) - 94usize];
    ["Offset of field: tss32::tss_ldt"][::std::mem::offset_of!(tss32, tss_ldt) - 96usize];
    ["Offset of field: tss32::tss_rsvd10"][::std::mem::offset_of!(tss32, tss_rsvd10) - 98usize];
    ["Offset of field: tss32::tss_rsvd11"][::std::mem::offset_of!(tss32, tss_rsvd11) - 100usize];
    ["Offset of field: tss32::tss_bitmapbase"]
        [::std::mem::offset_of!(tss32, tss_bitmapbase) - 102usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tss16 {
    pub tss_link: u16,
    pub tss_sp0: u16,
    pub tss_ss0: u16,
    pub tss_sp1: u16,
    pub tss_ss1: u16,
    pub tss_sp2: u16,
    pub tss_ss2: u16,
    pub tss_ip: u16,
    pub tss_flag: u16,
    pub tss_ax: u16,
    pub tss_cx: u16,
    pub tss_dx: u16,
    pub tss_bx: u16,
    pub tss_sp: u16,
    pub tss_bp: u16,
    pub tss_si: u16,
    pub tss_di: u16,
    pub tss_es: u16,
    pub tss_cs: u16,
    pub tss_ss: u16,
    pub tss_ds: u16,
    pub tss_ldt: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tss16"][::std::mem::size_of::<tss16>() - 44usize];
    ["Alignment of tss16"][::std::mem::align_of::<tss16>() - 2usize];
    ["Offset of field: tss16::tss_link"][::std::mem::offset_of!(tss16, tss_link) - 0usize];
    ["Offset of field: tss16::tss_sp0"][::std::mem::offset_of!(tss16, tss_sp0) - 2usize];
    ["Offset of field: tss16::tss_ss0"][::std::mem::offset_of!(tss16, tss_ss0) - 4usize];
    ["Offset of field: tss16::tss_sp1"][::std::mem::offset_of!(tss16, tss_sp1) - 6usize];
    ["Offset of field: tss16::tss_ss1"][::std::mem::offset_of!(tss16, tss_ss1) - 8usize];
    ["Offset of field: tss16::tss_sp2"][::std::mem::offset_of!(tss16, tss_sp2) - 10usize];
    ["Offset of field: tss16::tss_ss2"][::std::mem::offset_of!(tss16, tss_ss2) - 12usize];
    ["Offset of field: tss16::tss_ip"][::std::mem::offset_of!(tss16, tss_ip) - 14usize];
    ["Offset of field: tss16::tss_flag"][::std::mem::offset_of!(tss16, tss_flag) - 16usize];
    ["Offset of field: tss16::tss_ax"][::std::mem::offset_of!(tss16, tss_ax) - 18usize];
    ["Offset of field: tss16::tss_cx"][::std::mem::offset_of!(tss16, tss_cx) - 20usize];
    ["Offset of field: tss16::tss_dx"][::std::mem::offset_of!(tss16, tss_dx) - 22usize];
    ["Offset of field: tss16::tss_bx"][::std::mem::offset_of!(tss16, tss_bx) - 24usize];
    ["Offset of field: tss16::tss_sp"][::std::mem::offset_of!(tss16, tss_sp) - 26usize];
    ["Offset of field: tss16::tss_bp"][::std::mem::offset_of!(tss16, tss_bp) - 28usize];
    ["Offset of field: tss16::tss_si"][::std::mem::offset_of!(tss16, tss_si) - 30usize];
    ["Offset of field: tss16::tss_di"][::std::mem::offset_of!(tss16, tss_di) - 32usize];
    ["Offset of field: tss16::tss_es"][::std::mem::offset_of!(tss16, tss_es) - 34usize];
    ["Offset of field: tss16::tss_cs"][::std::mem::offset_of!(tss16, tss_cs) - 36usize];
    ["Offset of field: tss16::tss_ss"][::std::mem::offset_of!(tss16, tss_ss) - 38usize];
    ["Offset of field: tss16::tss_ds"][::std::mem::offset_of!(tss16, tss_ds) - 40usize];
    ["Offset of field: tss16::tss_ldt"][::std::mem::offset_of!(tss16, tss_ldt) - 42usize];
};
pub type tss_t = tss64;
pub type selector_t = u16;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct desctbr_t {
    pub dtr_limit: u16,
    pub dtr_base: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of desctbr_t"][::std::mem::size_of::<desctbr_t>() - 10usize];
    ["Alignment of desctbr_t"][::std::mem::align_of::<desctbr_t>() - 2usize];
    ["Offset of field: desctbr_t::dtr_limit"]
        [::std::mem::offset_of!(desctbr_t, dtr_limit) - 0usize];
    ["Offset of field: desctbr_t::dtr_base"][::std::mem::offset_of!(desctbr_t, dtr_base) - 2usize];
};
unsafe extern "C" {
    pub fn rd_idtr(arg1: *mut desctbr_t);
}
unsafe extern "C" {
    pub fn wr_idtr(arg1: *mut desctbr_t);
}
unsafe extern "C" {
    pub fn rd_gdtr(arg1: *mut desctbr_t);
}
unsafe extern "C" {
    pub fn wr_gdtr(arg1: *mut desctbr_t);
}
unsafe extern "C" {
    pub fn wr_ldtr(arg1: selector_t);
}
unsafe extern "C" {
    pub fn rd_ldtr() -> selector_t;
}
unsafe extern "C" {
    pub fn wr_tsr(arg1: selector_t);
}
unsafe extern "C" {
    pub fn kmdb_enter();
}
unsafe extern "C" {
    pub fn __set_ds(arg1: selector_t);
}
unsafe extern "C" {
    pub fn __set_es(arg1: selector_t);
}
unsafe extern "C" {
    pub fn __set_fs(arg1: selector_t);
}
unsafe extern "C" {
    pub fn __set_gs(arg1: selector_t);
}
unsafe extern "C" {
    pub fn load_segment_registers(
        arg1: selector_t,
        arg2: selector_t,
        arg3: selector_t,
        arg4: selector_t,
    );
}
unsafe extern "C" {
    pub fn get_cs_register() -> selector_t;
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct user_desc {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of user_desc"][::std::mem::size_of::<user_desc>() - 8usize];
    ["Alignment of user_desc"][::std::mem::align_of::<user_desc>() - 8usize];
};
impl user_desc {
    #[inline]
    pub fn usd_lolimit(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_usd_lolimit(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_lolimit_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_lolimit_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_lobase(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_usd_lobase(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_lobase_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_lobase_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_midbase(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_usd_midbase(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_midbase_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_midbase_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_type(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(40usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_usd_type(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(40usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_type_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                40usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_type_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_dpl(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(45usize, 2u8) as u64) }
    }
    #[inline]
    pub fn set_usd_dpl(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(45usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_dpl_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                45usize,
                2u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_dpl_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                45usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_p(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_usd_p(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_p_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                47usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_p_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                47usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_hilimit(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_usd_hilimit(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_hilimit_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                48usize,
                4u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_hilimit_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_avl(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(52usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_usd_avl(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(52usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_avl_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                52usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_avl_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                52usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_long(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(53usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_usd_long(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(53usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_long_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                53usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_long_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                53usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_def32(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(54usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_usd_def32(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(54usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_def32_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                54usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_def32_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                54usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_gran(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(55usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_usd_gran(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(55usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_gran_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                55usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_gran_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                55usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn usd_hibase(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_usd_hibase(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn usd_hibase_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                56usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_usd_hibase_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                56usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        usd_lolimit: u64,
        usd_lobase: u64,
        usd_midbase: u64,
        usd_type: u64,
        usd_dpl: u64,
        usd_p: u64,
        usd_hilimit: u64,
        usd_avl: u64,
        usd_long: u64,
        usd_def32: u64,
        usd_gran: u64,
        usd_hibase: u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let usd_lolimit: u64 = unsafe { ::std::mem::transmute(usd_lolimit) };
            usd_lolimit as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let usd_lobase: u64 = unsafe { ::std::mem::transmute(usd_lobase) };
            usd_lobase as u64
        });
        __bindgen_bitfield_unit.set(32usize, 8u8, {
            let usd_midbase: u64 = unsafe { ::std::mem::transmute(usd_midbase) };
            usd_midbase as u64
        });
        __bindgen_bitfield_unit.set(40usize, 5u8, {
            let usd_type: u64 = unsafe { ::std::mem::transmute(usd_type) };
            usd_type as u64
        });
        __bindgen_bitfield_unit.set(45usize, 2u8, {
            let usd_dpl: u64 = unsafe { ::std::mem::transmute(usd_dpl) };
            usd_dpl as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let usd_p: u64 = unsafe { ::std::mem::transmute(usd_p) };
            usd_p as u64
        });
        __bindgen_bitfield_unit.set(48usize, 4u8, {
            let usd_hilimit: u64 = unsafe { ::std::mem::transmute(usd_hilimit) };
            usd_hilimit as u64
        });
        __bindgen_bitfield_unit.set(52usize, 1u8, {
            let usd_avl: u64 = unsafe { ::std::mem::transmute(usd_avl) };
            usd_avl as u64
        });
        __bindgen_bitfield_unit.set(53usize, 1u8, {
            let usd_long: u64 = unsafe { ::std::mem::transmute(usd_long) };
            usd_long as u64
        });
        __bindgen_bitfield_unit.set(54usize, 1u8, {
            let usd_def32: u64 = unsafe { ::std::mem::transmute(usd_def32) };
            usd_def32 as u64
        });
        __bindgen_bitfield_unit.set(55usize, 1u8, {
            let usd_gran: u64 = unsafe { ::std::mem::transmute(usd_gran) };
            usd_gran as u64
        });
        __bindgen_bitfield_unit.set(56usize, 8u8, {
            let usd_hibase: u64 = unsafe { ::std::mem::transmute(usd_hibase) };
            usd_hibase as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type user_desc_t = user_desc;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct system_desc {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of system_desc"][::std::mem::size_of::<system_desc>() - 16usize];
    ["Alignment of system_desc"][::std::mem::align_of::<system_desc>() - 8usize];
};
impl system_desc {
    #[inline]
    pub fn ssd_lolimit(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_lolimit(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_lolimit_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_lolimit_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_lobase(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_lobase(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_lobase_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_lobase_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_midbase(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_midbase(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_midbase_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_midbase_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_type(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(40usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_type(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(40usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_type_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                40usize,
                4u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_type_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_zero1(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_zero1(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_zero1_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                44usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_zero1_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                44usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_dpl(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(45usize, 2u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_dpl(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(45usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_dpl_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                45usize,
                2u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_dpl_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                45usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_p(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_p(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_p_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                47usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_p_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                47usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_hilimit(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_hilimit(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_hilimit_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                48usize,
                4u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_hilimit_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_avl(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(52usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_avl(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(52usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_avl_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                52usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_avl_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                52usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_resv1(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(53usize, 2u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_resv1(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(53usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_resv1_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                53usize,
                2u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_resv1_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                53usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_gran(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(55usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_gran(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(55usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_gran_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                55usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_gran_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                55usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_hibase(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_hibase(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_hibase_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                56usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_hibase_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                56usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_hi64base(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 32u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_hi64base(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_hi64base_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                64usize,
                32u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_hi64base_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                64usize,
                32u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_resv2(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(96usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_resv2(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(96usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_resv2_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                96usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_resv2_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                96usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_zero2(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(104usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_zero2(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(104usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_zero2_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                104usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_zero2_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                104usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ssd_resv3(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(109usize, 19u8) as u64) }
    }
    #[inline]
    pub fn set_ssd_resv3(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(109usize, 19u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ssd_resv3_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                109usize,
                19u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_ssd_resv3_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                109usize,
                19u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ssd_lolimit: u64,
        ssd_lobase: u64,
        ssd_midbase: u64,
        ssd_type: u64,
        ssd_zero1: u64,
        ssd_dpl: u64,
        ssd_p: u64,
        ssd_hilimit: u64,
        ssd_avl: u64,
        ssd_resv1: u64,
        ssd_gran: u64,
        ssd_hibase: u64,
        ssd_hi64base: u64,
        ssd_resv2: u64,
        ssd_zero2: u64,
        ssd_resv3: u64,
    ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let ssd_lolimit: u64 = unsafe { ::std::mem::transmute(ssd_lolimit) };
            ssd_lolimit as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let ssd_lobase: u64 = unsafe { ::std::mem::transmute(ssd_lobase) };
            ssd_lobase as u64
        });
        __bindgen_bitfield_unit.set(32usize, 8u8, {
            let ssd_midbase: u64 = unsafe { ::std::mem::transmute(ssd_midbase) };
            ssd_midbase as u64
        });
        __bindgen_bitfield_unit.set(40usize, 4u8, {
            let ssd_type: u64 = unsafe { ::std::mem::transmute(ssd_type) };
            ssd_type as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let ssd_zero1: u64 = unsafe { ::std::mem::transmute(ssd_zero1) };
            ssd_zero1 as u64
        });
        __bindgen_bitfield_unit.set(45usize, 2u8, {
            let ssd_dpl: u64 = unsafe { ::std::mem::transmute(ssd_dpl) };
            ssd_dpl as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let ssd_p: u64 = unsafe { ::std::mem::transmute(ssd_p) };
            ssd_p as u64
        });
        __bindgen_bitfield_unit.set(48usize, 4u8, {
            let ssd_hilimit: u64 = unsafe { ::std::mem::transmute(ssd_hilimit) };
            ssd_hilimit as u64
        });
        __bindgen_bitfield_unit.set(52usize, 1u8, {
            let ssd_avl: u64 = unsafe { ::std::mem::transmute(ssd_avl) };
            ssd_avl as u64
        });
        __bindgen_bitfield_unit.set(53usize, 2u8, {
            let ssd_resv1: u64 = unsafe { ::std::mem::transmute(ssd_resv1) };
            ssd_resv1 as u64
        });
        __bindgen_bitfield_unit.set(55usize, 1u8, {
            let ssd_gran: u64 = unsafe { ::std::mem::transmute(ssd_gran) };
            ssd_gran as u64
        });
        __bindgen_bitfield_unit.set(56usize, 8u8, {
            let ssd_hibase: u64 = unsafe { ::std::mem::transmute(ssd_hibase) };
            ssd_hibase as u64
        });
        __bindgen_bitfield_unit.set(64usize, 32u8, {
            let ssd_hi64base: u64 = unsafe { ::std::mem::transmute(ssd_hi64base) };
            ssd_hi64base as u64
        });
        __bindgen_bitfield_unit.set(96usize, 8u8, {
            let ssd_resv2: u64 = unsafe { ::std::mem::transmute(ssd_resv2) };
            ssd_resv2 as u64
        });
        __bindgen_bitfield_unit.set(104usize, 5u8, {
            let ssd_zero2: u64 = unsafe { ::std::mem::transmute(ssd_zero2) };
            ssd_zero2 as u64
        });
        __bindgen_bitfield_unit.set(109usize, 19u8, {
            let ssd_resv3: u64 = unsafe { ::std::mem::transmute(ssd_resv3) };
            ssd_resv3 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type system_desc_t = system_desc;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct gate_desc {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gate_desc"][::std::mem::size_of::<gate_desc>() - 16usize];
    ["Alignment of gate_desc"][::std::mem::align_of::<gate_desc>() - 8usize];
};
impl gate_desc {
    #[inline]
    pub fn sgd_looffset(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_looffset(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_looffset_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_looffset_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_selector(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_selector(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_selector_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_selector_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_ist(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 3u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_ist(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_ist_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                3u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_ist_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_resv1(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(35usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_resv1(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(35usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_resv1_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                35usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_resv1_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                35usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_type(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(40usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_type(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(40usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_type_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                40usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_type_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_dpl(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(45usize, 2u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_dpl(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(45usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_dpl_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                45usize,
                2u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_dpl_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                45usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_p(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_p(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_p_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                47usize,
                1u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_p_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                47usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_hioffset(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_hioffset(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_hioffset_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                48usize,
                16u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_hioffset_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_hi64offset(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 32u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_hi64offset(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(64usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_hi64offset_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                64usize,
                32u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_hi64offset_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                64usize,
                32u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_resv2(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(96usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_resv2(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(96usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_resv2_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                96usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_resv2_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                96usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_zero(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(104usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_zero(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(104usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_zero_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                104usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_zero_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                104usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sgd_resv3(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(109usize, 19u8) as u64) }
    }
    #[inline]
    pub fn set_sgd_resv3(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(109usize, 19u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sgd_resv3_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                109usize,
                19u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_sgd_resv3_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                109usize,
                19u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sgd_looffset: u64,
        sgd_selector: u64,
        sgd_ist: u64,
        sgd_resv1: u64,
        sgd_type: u64,
        sgd_dpl: u64,
        sgd_p: u64,
        sgd_hioffset: u64,
        sgd_hi64offset: u64,
        sgd_resv2: u64,
        sgd_zero: u64,
        sgd_resv3: u64,
    ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let sgd_looffset: u64 = unsafe { ::std::mem::transmute(sgd_looffset) };
            sgd_looffset as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let sgd_selector: u64 = unsafe { ::std::mem::transmute(sgd_selector) };
            sgd_selector as u64
        });
        __bindgen_bitfield_unit.set(32usize, 3u8, {
            let sgd_ist: u64 = unsafe { ::std::mem::transmute(sgd_ist) };
            sgd_ist as u64
        });
        __bindgen_bitfield_unit.set(35usize, 5u8, {
            let sgd_resv1: u64 = unsafe { ::std::mem::transmute(sgd_resv1) };
            sgd_resv1 as u64
        });
        __bindgen_bitfield_unit.set(40usize, 5u8, {
            let sgd_type: u64 = unsafe { ::std::mem::transmute(sgd_type) };
            sgd_type as u64
        });
        __bindgen_bitfield_unit.set(45usize, 2u8, {
            let sgd_dpl: u64 = unsafe { ::std::mem::transmute(sgd_dpl) };
            sgd_dpl as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let sgd_p: u64 = unsafe { ::std::mem::transmute(sgd_p) };
            sgd_p as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let sgd_hioffset: u64 = unsafe { ::std::mem::transmute(sgd_hioffset) };
            sgd_hioffset as u64
        });
        __bindgen_bitfield_unit.set(64usize, 32u8, {
            let sgd_hi64offset: u64 = unsafe { ::std::mem::transmute(sgd_hi64offset) };
            sgd_hi64offset as u64
        });
        __bindgen_bitfield_unit.set(96usize, 8u8, {
            let sgd_resv2: u64 = unsafe { ::std::mem::transmute(sgd_resv2) };
            sgd_resv2 as u64
        });
        __bindgen_bitfield_unit.set(104usize, 5u8, {
            let sgd_zero: u64 = unsafe { ::std::mem::transmute(sgd_zero) };
            sgd_zero as u64
        });
        __bindgen_bitfield_unit.set(109usize, 19u8, {
            let sgd_resv3: u64 = unsafe { ::std::mem::transmute(sgd_resv3) };
            sgd_resv3 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type gate_desc_t = gate_desc;
unsafe extern "C" {
    pub fn set_usegd(
        arg1: *mut user_desc_t,
        arg2: uint_t,
        arg3: *mut ::std::os::raw::c_void,
        arg4: u32,
        arg5: uint_t,
        arg6: uint_t,
        arg7: uint_t,
        arg8: uint_t,
    );
}
unsafe extern "C" {
    pub fn idt_vector_to_ist(arg1: uint_t) -> uint_t;
}
unsafe extern "C" {
    pub fn set_gatesegd(
        arg1: *mut gate_desc_t,
        arg2: ::std::option::Option<unsafe extern "C" fn()>,
        arg3: selector_t,
        arg4: uint_t,
        arg5: uint_t,
        arg6: uint_t,
    );
}
unsafe extern "C" {
    pub fn set_syssegd(
        arg1: *mut system_desc_t,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: uint_t,
        arg5: uint_t,
    );
}
unsafe extern "C" {
    pub fn get_ssd_base(arg1: *mut system_desc_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn gdt_update_usegd(arg1: uint_t, arg2: *mut user_desc_t);
}
unsafe extern "C" {
    pub fn ldt_update_segd(arg1: *mut user_desc_t, arg2: *mut user_desc_t)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn init_boot_gdt(arg1: *mut user_desc_t);
}
unsafe extern "C" {
    pub static mut idt0: *mut gate_desc_t;
}
unsafe extern "C" {
    pub static mut idt0_default_reg: desctbr_t;
}
unsafe extern "C" {
    pub static mut gdt0: *mut user_desc_t;
}
unsafe extern "C" {
    pub static mut zero_udesc: user_desc_t;
}
unsafe extern "C" {
    pub static mut null_udesc: user_desc_t;
}
unsafe extern "C" {
    pub static mut null_sdesc: system_desc_t;
}
unsafe extern "C" {
    pub static mut zero_u32desc: user_desc_t;
}
unsafe extern "C" {
    pub static mut ucs_on: user_desc_t;
}
unsafe extern "C" {
    pub static mut ucs_off: user_desc_t;
}
unsafe extern "C" {
    pub static mut ucs32_on: user_desc_t;
}
unsafe extern "C" {
    pub static mut ucs32_off: user_desc_t;
}
unsafe extern "C" {
    pub static mut ktss0: *mut tss_t;
}
unsafe extern "C" {
    pub fn div0trap();
}
unsafe extern "C" {
    pub fn dbgtrap();
}
unsafe extern "C" {
    pub fn nmiint();
}
unsafe extern "C" {
    pub fn brktrap();
}
unsafe extern "C" {
    pub fn ovflotrap();
}
unsafe extern "C" {
    pub fn boundstrap();
}
unsafe extern "C" {
    pub fn invoptrap();
}
unsafe extern "C" {
    pub fn ndptrap();
}
unsafe extern "C" {
    pub fn syserrtrap();
}
unsafe extern "C" {
    pub fn invaltrap();
}
unsafe extern "C" {
    pub fn invtsstrap();
}
unsafe extern "C" {
    pub fn segnptrap();
}
unsafe extern "C" {
    pub fn stktrap();
}
unsafe extern "C" {
    pub fn gptrap();
}
unsafe extern "C" {
    pub fn pftrap();
}
unsafe extern "C" {
    pub fn ndperr();
}
unsafe extern "C" {
    pub fn overrun();
}
unsafe extern "C" {
    pub fn resvtrap();
}
unsafe extern "C" {
    pub fn _start();
}
unsafe extern "C" {
    pub fn cmnint();
}
unsafe extern "C" {
    pub fn achktrap();
}
unsafe extern "C" {
    pub fn mcetrap();
}
unsafe extern "C" {
    pub fn xmtrap();
}
unsafe extern "C" {
    pub fn fasttrap();
}
unsafe extern "C" {
    pub fn dtrace_ret();
}
unsafe extern "C" {
    pub fn tr_invaltrap();
}
unsafe extern "C" {
    pub fn tr_div0trap();
}
unsafe extern "C" {
    pub fn tr_dbgtrap();
}
unsafe extern "C" {
    pub fn tr_nmiint();
}
unsafe extern "C" {
    pub fn tr_brktrap();
}
unsafe extern "C" {
    pub fn tr_ovflotrap();
}
unsafe extern "C" {
    pub fn tr_boundstrap();
}
unsafe extern "C" {
    pub fn tr_invoptrap();
}
unsafe extern "C" {
    pub fn tr_ndptrap();
}
unsafe extern "C" {
    pub fn tr_syserrtrap();
}
unsafe extern "C" {
    pub fn tr_invtsstrap();
}
unsafe extern "C" {
    pub fn tr_segnptrap();
}
unsafe extern "C" {
    pub fn tr_stktrap();
}
unsafe extern "C" {
    pub fn tr_gptrap();
}
unsafe extern "C" {
    pub fn tr_pftrap();
}
unsafe extern "C" {
    pub fn tr_ndperr();
}
unsafe extern "C" {
    pub fn tr_overrun();
}
unsafe extern "C" {
    pub fn tr_resvtrap();
}
unsafe extern "C" {
    pub fn tr_achktrap();
}
unsafe extern "C" {
    pub fn tr_mcetrap();
}
unsafe extern "C" {
    pub fn tr_xmtrap();
}
unsafe extern "C" {
    pub fn tr_fasttrap();
}
unsafe extern "C" {
    pub fn tr_dtrace_ret();
}
unsafe extern "C" {
    pub static mut kpti_enable: u64;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fnsave_state {
    pub f_fcw: u16,
    pub __f_ign0: u16,
    pub f_fsw: u16,
    pub __f_ign1: u16,
    pub f_ftw: u16,
    pub __f_ign2: u16,
    pub f_eip: u32,
    pub f_cs: u16,
    pub f_fop: u16,
    pub f_dp: u32,
    pub f_ds: u16,
    pub __f_ign3: u16,
    pub f_st: [fnsave_state__bindgen_ty_1; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fnsave_state__bindgen_ty_1 {
    pub fpr_16: [u16; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fnsave_state__bindgen_ty_1"]
        [::std::mem::size_of::<fnsave_state__bindgen_ty_1>() - 10usize];
    ["Alignment of fnsave_state__bindgen_ty_1"]
        [::std::mem::align_of::<fnsave_state__bindgen_ty_1>() - 2usize];
    ["Offset of field: fnsave_state__bindgen_ty_1::fpr_16"]
        [::std::mem::offset_of!(fnsave_state__bindgen_ty_1, fpr_16) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fnsave_state"][::std::mem::size_of::<fnsave_state>() - 108usize];
    ["Alignment of fnsave_state"][::std::mem::align_of::<fnsave_state>() - 4usize];
    ["Offset of field: fnsave_state::f_fcw"][::std::mem::offset_of!(fnsave_state, f_fcw) - 0usize];
    ["Offset of field: fnsave_state::__f_ign0"]
        [::std::mem::offset_of!(fnsave_state, __f_ign0) - 2usize];
    ["Offset of field: fnsave_state::f_fsw"][::std::mem::offset_of!(fnsave_state, f_fsw) - 4usize];
    ["Offset of field: fnsave_state::__f_ign1"]
        [::std::mem::offset_of!(fnsave_state, __f_ign1) - 6usize];
    ["Offset of field: fnsave_state::f_ftw"][::std::mem::offset_of!(fnsave_state, f_ftw) - 8usize];
    ["Offset of field: fnsave_state::__f_ign2"]
        [::std::mem::offset_of!(fnsave_state, __f_ign2) - 10usize];
    ["Offset of field: fnsave_state::f_eip"][::std::mem::offset_of!(fnsave_state, f_eip) - 12usize];
    ["Offset of field: fnsave_state::f_cs"][::std::mem::offset_of!(fnsave_state, f_cs) - 16usize];
    ["Offset of field: fnsave_state::f_fop"][::std::mem::offset_of!(fnsave_state, f_fop) - 18usize];
    ["Offset of field: fnsave_state::f_dp"][::std::mem::offset_of!(fnsave_state, f_dp) - 20usize];
    ["Offset of field: fnsave_state::f_ds"][::std::mem::offset_of!(fnsave_state, f_ds) - 24usize];
    ["Offset of field: fnsave_state::__f_ign3"]
        [::std::mem::offset_of!(fnsave_state, __f_ign3) - 26usize];
    ["Offset of field: fnsave_state::f_st"][::std::mem::offset_of!(fnsave_state, f_st) - 28usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct fxsave_state {
    pub fx_fcw: u16,
    pub fx_fsw: u16,
    pub fx_fctw: u16,
    pub fx_fop: u16,
    pub fx_rip: u64,
    pub fx_rdp: u64,
    pub fx_mxcsr: u32,
    pub fx_mxcsr_mask: u32,
    pub fx_st: [fxsave_state__bindgen_ty_1; 8usize],
    pub fx_xmm: [upad128_t; 16usize],
    pub __fx_ign2: [upad128_t; 6usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fxsave_state__bindgen_ty_1 {
    pub fpr_16: [u16; 5usize],
    pub fpr_mmx: u_longlong_t,
    pub __fpr_pad: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxsave_state__bindgen_ty_1"]
        [::std::mem::size_of::<fxsave_state__bindgen_ty_1>() - 16usize];
    ["Alignment of fxsave_state__bindgen_ty_1"]
        [::std::mem::align_of::<fxsave_state__bindgen_ty_1>() - 8usize];
    ["Offset of field: fxsave_state__bindgen_ty_1::fpr_16"]
        [::std::mem::offset_of!(fxsave_state__bindgen_ty_1, fpr_16) - 0usize];
    ["Offset of field: fxsave_state__bindgen_ty_1::fpr_mmx"]
        [::std::mem::offset_of!(fxsave_state__bindgen_ty_1, fpr_mmx) - 0usize];
    ["Offset of field: fxsave_state__bindgen_ty_1::__fpr_pad"]
        [::std::mem::offset_of!(fxsave_state__bindgen_ty_1, __fpr_pad) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxsave_state"][::std::mem::size_of::<fxsave_state>() - 512usize];
    ["Alignment of fxsave_state"][::std::mem::align_of::<fxsave_state>() - 16usize];
    ["Offset of field: fxsave_state::fx_fcw"]
        [::std::mem::offset_of!(fxsave_state, fx_fcw) - 0usize];
    ["Offset of field: fxsave_state::fx_fsw"]
        [::std::mem::offset_of!(fxsave_state, fx_fsw) - 2usize];
    ["Offset of field: fxsave_state::fx_fctw"]
        [::std::mem::offset_of!(fxsave_state, fx_fctw) - 4usize];
    ["Offset of field: fxsave_state::fx_fop"]
        [::std::mem::offset_of!(fxsave_state, fx_fop) - 6usize];
    ["Offset of field: fxsave_state::fx_rip"]
        [::std::mem::offset_of!(fxsave_state, fx_rip) - 8usize];
    ["Offset of field: fxsave_state::fx_rdp"]
        [::std::mem::offset_of!(fxsave_state, fx_rdp) - 16usize];
    ["Offset of field: fxsave_state::fx_mxcsr"]
        [::std::mem::offset_of!(fxsave_state, fx_mxcsr) - 24usize];
    ["Offset of field: fxsave_state::fx_mxcsr_mask"]
        [::std::mem::offset_of!(fxsave_state, fx_mxcsr_mask) - 28usize];
    ["Offset of field: fxsave_state::fx_st"][::std::mem::offset_of!(fxsave_state, fx_st) - 32usize];
    ["Offset of field: fxsave_state::fx_xmm"]
        [::std::mem::offset_of!(fxsave_state, fx_xmm) - 160usize];
    ["Offset of field: fxsave_state::__fx_ign2"]
        [::std::mem::offset_of!(fxsave_state, __fx_ign2) - 416usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xsave_header {
    pub xsh_xstate_bv: u64,
    pub xsh_xcomp_bv: u64,
    pub xsh_reserved: [u64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xsave_header"][::std::mem::size_of::<xsave_header>() - 64usize];
    ["Alignment of xsave_header"][::std::mem::align_of::<xsave_header>() - 8usize];
    ["Offset of field: xsave_header::xsh_xstate_bv"]
        [::std::mem::offset_of!(xsave_header, xsh_xstate_bv) - 0usize];
    ["Offset of field: xsave_header::xsh_xcomp_bv"]
        [::std::mem::offset_of!(xsave_header, xsh_xcomp_bv) - 8usize];
    ["Offset of field: xsave_header::xsh_reserved"]
        [::std::mem::offset_of!(xsave_header, xsh_reserved) - 16usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub struct xsave_state {
    pub xs_fxsave: fxsave_state,
    pub xs_header: xsave_header,
    pub xs_ymm: [upad128_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xsave_state"][::std::mem::size_of::<xsave_state>() - 832usize];
    ["Alignment of xsave_state"][::std::mem::align_of::<xsave_state>() - 64usize];
    ["Offset of field: xsave_state::xs_fxsave"]
        [::std::mem::offset_of!(xsave_state, xs_fxsave) - 0usize];
    ["Offset of field: xsave_state::xs_header"]
        [::std::mem::offset_of!(xsave_state, xs_header) - 512usize];
    ["Offset of field: xsave_state::xs_ymm"]
        [::std::mem::offset_of!(xsave_state, xs_ymm) - 576usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kfpu_t {
    pub kfpu_u: kfpu_t__kfpu_u,
    pub kfpu_status: u32,
    pub kfpu_xstatus: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kfpu_t__kfpu_u {
    pub kfpu_generic: *mut ::std::os::raw::c_void,
    pub kfpu_fx: *mut fxsave_state,
    pub kfpu_xs: *mut xsave_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kfpu_t__kfpu_u"][::std::mem::size_of::<kfpu_t__kfpu_u>() - 8usize];
    ["Alignment of kfpu_t__kfpu_u"][::std::mem::align_of::<kfpu_t__kfpu_u>() - 8usize];
    ["Offset of field: kfpu_t__kfpu_u::kfpu_generic"]
        [::std::mem::offset_of!(kfpu_t__kfpu_u, kfpu_generic) - 0usize];
    ["Offset of field: kfpu_t__kfpu_u::kfpu_fx"]
        [::std::mem::offset_of!(kfpu_t__kfpu_u, kfpu_fx) - 0usize];
    ["Offset of field: kfpu_t__kfpu_u::kfpu_xs"]
        [::std::mem::offset_of!(kfpu_t__kfpu_u, kfpu_xs) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kfpu_t"][::std::mem::size_of::<kfpu_t>() - 16usize];
    ["Alignment of kfpu_t"][::std::mem::align_of::<kfpu_t>() - 8usize];
    ["Offset of field: kfpu_t::kfpu_u"][::std::mem::offset_of!(kfpu_t, kfpu_u) - 0usize];
    ["Offset of field: kfpu_t::kfpu_status"][::std::mem::offset_of!(kfpu_t, kfpu_status) - 8usize];
    ["Offset of field: kfpu_t::kfpu_xstatus"]
        [::std::mem::offset_of!(kfpu_t, kfpu_xstatus) - 12usize];
};
unsafe extern "C" {
    pub static mut fp_kind: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut fp_save_mech: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut fpu_exists: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut fp_elf: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut xsave_bv_all: u64;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fpu_ctx {
    pub fpu_regs: kfpu_t,
    pub fpu_xsave_mask: u64,
    pub fpu_flags: uint_t,
    pub fpu_signal: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpu_ctx"][::std::mem::size_of::<fpu_ctx>() - 40usize];
    ["Alignment of fpu_ctx"][::std::mem::align_of::<fpu_ctx>() - 8usize];
    ["Offset of field: fpu_ctx::fpu_regs"][::std::mem::offset_of!(fpu_ctx, fpu_regs) - 0usize];
    ["Offset of field: fpu_ctx::fpu_xsave_mask"]
        [::std::mem::offset_of!(fpu_ctx, fpu_xsave_mask) - 16usize];
    ["Offset of field: fpu_ctx::fpu_flags"][::std::mem::offset_of!(fpu_ctx, fpu_flags) - 24usize];
    ["Offset of field: fpu_ctx::fpu_signal"][::std::mem::offset_of!(fpu_ctx, fpu_signal) - 32usize];
};
pub type fpu_ctx_t = fpu_ctx;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pcb {
    pub pcb_fpu: fpu_ctx_t,
    pub pcb_flags: uint_t,
    pub pcb_drstat: greg_t,
    pub pcb_instr: ::std::os::raw::c_uchar,
    pub pcb_rupdate: ::std::os::raw::c_uchar,
    pub pcb_fsbase: usize,
    pub pcb_gsbase: usize,
    pub pcb_ds: selector_t,
    pub pcb_es: selector_t,
    pub pcb_fs: selector_t,
    pub pcb_gs: selector_t,
    pub pcb_fsdesc: user_desc_t,
    pub pcb_gsdesc: user_desc_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcb"][::std::mem::size_of::<pcb>() - 104usize];
    ["Alignment of pcb"][::std::mem::align_of::<pcb>() - 8usize];
    ["Offset of field: pcb::pcb_fpu"][::std::mem::offset_of!(pcb, pcb_fpu) - 0usize];
    ["Offset of field: pcb::pcb_flags"][::std::mem::offset_of!(pcb, pcb_flags) - 40usize];
    ["Offset of field: pcb::pcb_drstat"][::std::mem::offset_of!(pcb, pcb_drstat) - 48usize];
    ["Offset of field: pcb::pcb_instr"][::std::mem::offset_of!(pcb, pcb_instr) - 56usize];
    ["Offset of field: pcb::pcb_rupdate"][::std::mem::offset_of!(pcb, pcb_rupdate) - 57usize];
    ["Offset of field: pcb::pcb_fsbase"][::std::mem::offset_of!(pcb, pcb_fsbase) - 64usize];
    ["Offset of field: pcb::pcb_gsbase"][::std::mem::offset_of!(pcb, pcb_gsbase) - 72usize];
    ["Offset of field: pcb::pcb_ds"][::std::mem::offset_of!(pcb, pcb_ds) - 80usize];
    ["Offset of field: pcb::pcb_es"][::std::mem::offset_of!(pcb, pcb_es) - 82usize];
    ["Offset of field: pcb::pcb_fs"][::std::mem::offset_of!(pcb, pcb_fs) - 84usize];
    ["Offset of field: pcb::pcb_gs"][::std::mem::offset_of!(pcb, pcb_gs) - 86usize];
    ["Offset of field: pcb::pcb_fsdesc"][::std::mem::offset_of!(pcb, pcb_fsdesc) - 88usize];
    ["Offset of field: pcb::pcb_gsdesc"][::std::mem::offset_of!(pcb, pcb_gsdesc) - 96usize];
};
pub type pcb_t = pcb;
pub type ucontext_t = ucontext;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct ucontext {
    pub uc_flags: ::std::os::raw::c_ulong,
    pub uc_link: *mut ucontext_t,
    pub uc_sigmask: sigset_t,
    pub uc_stack: stack_t,
    pub __bindgen_padding_0: u64,
    pub uc_mcontext: mcontext_t,
    pub uc_filler: [::std::os::raw::c_long; 3usize],
    pub uc_xsave: ::std::os::raw::c_long,
    pub uc_filler1: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ucontext"][::std::mem::size_of::<ucontext>() - 864usize];
    ["Alignment of ucontext"][::std::mem::align_of::<ucontext>() - 16usize];
    ["Offset of field: ucontext::uc_flags"][::std::mem::offset_of!(ucontext, uc_flags) - 0usize];
    ["Offset of field: ucontext::uc_link"][::std::mem::offset_of!(ucontext, uc_link) - 8usize];
    ["Offset of field: ucontext::uc_sigmask"]
        [::std::mem::offset_of!(ucontext, uc_sigmask) - 16usize];
    ["Offset of field: ucontext::uc_stack"][::std::mem::offset_of!(ucontext, uc_stack) - 32usize];
    ["Offset of field: ucontext::uc_mcontext"]
        [::std::mem::offset_of!(ucontext, uc_mcontext) - 64usize];
    ["Offset of field: ucontext::uc_filler"]
        [::std::mem::offset_of!(ucontext, uc_filler) - 816usize];
    ["Offset of field: ucontext::uc_xsave"][::std::mem::offset_of!(ucontext, uc_xsave) - 840usize];
    ["Offset of field: ucontext::uc_filler1"]
        [::std::mem::offset_of!(ucontext, uc_filler1) - 848usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _lwp_mutex {
    pub flags: _lwp_mutex__bindgen_ty_1,
    pub lock: _lwp_mutex__bindgen_ty_2,
    pub data: upad64_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _lwp_mutex__bindgen_ty_1 {
    pub flag1: u16,
    pub flag2: u8,
    pub ceiling: u8,
    pub mbcp_type_un: _lwp_mutex__bindgen_ty_1__bindgen_ty_1,
    pub magic: u16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _lwp_mutex__bindgen_ty_1__bindgen_ty_1 {
    pub bcptype: u16,
    pub mtype_rcount: _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub count_type1: u8,
    pub count_type2: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::count_type1"][::std::mem::offset_of!(
        _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        count_type1
    )
        - 0usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::count_type2"][::std::mem::offset_of!(
        _lwp_mutex__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        count_type2
    )
        - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_lwp_mutex__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of _lwp_mutex__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_lwp_mutex__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1__bindgen_ty_1::bcptype"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1__bindgen_ty_1, bcptype) - 0usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1__bindgen_ty_1::mtype_rcount"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1__bindgen_ty_1, mtype_rcount) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex__bindgen_ty_1"]
        [::std::mem::size_of::<_lwp_mutex__bindgen_ty_1>() - 8usize];
    ["Alignment of _lwp_mutex__bindgen_ty_1"]
        [::std::mem::align_of::<_lwp_mutex__bindgen_ty_1>() - 2usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1::flag1"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1, flag1) - 0usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1::flag2"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1, flag2) - 2usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1::ceiling"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1, ceiling) - 3usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1::mbcp_type_un"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1, mbcp_type_un) - 4usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_1::magic"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_1, magic) - 6usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _lwp_mutex__bindgen_ty_2 {
    pub lock64: _lwp_mutex__bindgen_ty_2__bindgen_ty_1,
    pub lock32: _lwp_mutex__bindgen_ty_2__bindgen_ty_2,
    pub owner64: upad64_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lwp_mutex__bindgen_ty_2__bindgen_ty_1 {
    pub pad: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<_lwp_mutex__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of _lwp_mutex__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<_lwp_mutex__bindgen_ty_2__bindgen_ty_1>() - 1usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_2__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_2__bindgen_ty_1, pad) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lwp_mutex__bindgen_ty_2__bindgen_ty_2 {
    pub ownerpid: u32,
    pub lockword: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::size_of::<_lwp_mutex__bindgen_ty_2__bindgen_ty_2>() - 8usize];
    ["Alignment of _lwp_mutex__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::align_of::<_lwp_mutex__bindgen_ty_2__bindgen_ty_2>() - 4usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_2__bindgen_ty_2::ownerpid"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_2__bindgen_ty_2, ownerpid) - 0usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_2__bindgen_ty_2::lockword"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_2__bindgen_ty_2, lockword) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex__bindgen_ty_2"]
        [::std::mem::size_of::<_lwp_mutex__bindgen_ty_2>() - 8usize];
    ["Alignment of _lwp_mutex__bindgen_ty_2"]
        [::std::mem::align_of::<_lwp_mutex__bindgen_ty_2>() - 8usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_2::lock64"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_2, lock64) - 0usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_2::lock32"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_2, lock32) - 0usize];
    ["Offset of field: _lwp_mutex__bindgen_ty_2::owner64"]
        [::std::mem::offset_of!(_lwp_mutex__bindgen_ty_2, owner64) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_mutex"][::std::mem::size_of::<_lwp_mutex>() - 24usize];
    ["Alignment of _lwp_mutex"][::std::mem::align_of::<_lwp_mutex>() - 8usize];
    ["Offset of field: _lwp_mutex::flags"][::std::mem::offset_of!(_lwp_mutex, flags) - 0usize];
    ["Offset of field: _lwp_mutex::lock"][::std::mem::offset_of!(_lwp_mutex, lock) - 8usize];
    ["Offset of field: _lwp_mutex::data"][::std::mem::offset_of!(_lwp_mutex, data) - 16usize];
};
pub type lwp_mutex_t = _lwp_mutex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lwp_cond {
    pub flags: _lwp_cond__bindgen_ty_1,
    pub data: upad64_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lwp_cond__bindgen_ty_1 {
    pub flag: [u8; 4usize],
    pub type_: u16,
    pub magic: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_cond__bindgen_ty_1"][::std::mem::size_of::<_lwp_cond__bindgen_ty_1>() - 8usize];
    ["Alignment of _lwp_cond__bindgen_ty_1"]
        [::std::mem::align_of::<_lwp_cond__bindgen_ty_1>() - 2usize];
    ["Offset of field: _lwp_cond__bindgen_ty_1::flag"]
        [::std::mem::offset_of!(_lwp_cond__bindgen_ty_1, flag) - 0usize];
    ["Offset of field: _lwp_cond__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(_lwp_cond__bindgen_ty_1, type_) - 4usize];
    ["Offset of field: _lwp_cond__bindgen_ty_1::magic"]
        [::std::mem::offset_of!(_lwp_cond__bindgen_ty_1, magic) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_cond"][::std::mem::size_of::<_lwp_cond>() - 16usize];
    ["Alignment of _lwp_cond"][::std::mem::align_of::<_lwp_cond>() - 8usize];
    ["Offset of field: _lwp_cond::flags"][::std::mem::offset_of!(_lwp_cond, flags) - 0usize];
    ["Offset of field: _lwp_cond::data"][::std::mem::offset_of!(_lwp_cond, data) - 8usize];
};
pub type lwp_cond_t = _lwp_cond;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lwp_sema {
    pub count: u32,
    pub type_: u16,
    pub magic: u16,
    pub flags: [u8; 8usize],
    pub data: upad64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_sema"][::std::mem::size_of::<_lwp_sema>() - 24usize];
    ["Alignment of _lwp_sema"][::std::mem::align_of::<_lwp_sema>() - 8usize];
    ["Offset of field: _lwp_sema::count"][::std::mem::offset_of!(_lwp_sema, count) - 0usize];
    ["Offset of field: _lwp_sema::type_"][::std::mem::offset_of!(_lwp_sema, type_) - 4usize];
    ["Offset of field: _lwp_sema::magic"][::std::mem::offset_of!(_lwp_sema, magic) - 6usize];
    ["Offset of field: _lwp_sema::flags"][::std::mem::offset_of!(_lwp_sema, flags) - 8usize];
    ["Offset of field: _lwp_sema::data"][::std::mem::offset_of!(_lwp_sema, data) - 16usize];
};
pub type lwp_sema_t = _lwp_sema;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _lwp_rwlock {
    pub readers: i32,
    pub type_: u16,
    pub magic: u16,
    pub mutex: lwp_mutex_t,
    pub readercv: lwp_cond_t,
    pub writercv: lwp_cond_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lwp_rwlock"][::std::mem::size_of::<_lwp_rwlock>() - 64usize];
    ["Alignment of _lwp_rwlock"][::std::mem::align_of::<_lwp_rwlock>() - 8usize];
    ["Offset of field: _lwp_rwlock::readers"]
        [::std::mem::offset_of!(_lwp_rwlock, readers) - 0usize];
    ["Offset of field: _lwp_rwlock::type_"][::std::mem::offset_of!(_lwp_rwlock, type_) - 4usize];
    ["Offset of field: _lwp_rwlock::magic"][::std::mem::offset_of!(_lwp_rwlock, magic) - 6usize];
    ["Offset of field: _lwp_rwlock::mutex"][::std::mem::offset_of!(_lwp_rwlock, mutex) - 8usize];
    ["Offset of field: _lwp_rwlock::readercv"]
        [::std::mem::offset_of!(_lwp_rwlock, readercv) - 32usize];
    ["Offset of field: _lwp_rwlock::writercv"]
        [::std::mem::offset_of!(_lwp_rwlock, writercv) - 48usize];
};
pub type lwp_rwlock_t = _lwp_rwlock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lwpinfo {
    pub lwp_utime: timestruc_t,
    pub lwp_stime: timestruc_t,
    pub lwpinfo_pad: [::std::os::raw::c_long; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lwpinfo"][::std::mem::size_of::<lwpinfo>() - 544usize];
    ["Alignment of lwpinfo"][::std::mem::align_of::<lwpinfo>() - 8usize];
    ["Offset of field: lwpinfo::lwp_utime"][::std::mem::offset_of!(lwpinfo, lwp_utime) - 0usize];
    ["Offset of field: lwpinfo::lwp_stime"][::std::mem::offset_of!(lwpinfo, lwp_stime) - 16usize];
    ["Offset of field: lwpinfo::lwpinfo_pad"]
        [::std::mem::offset_of!(lwpinfo, lwpinfo_pad) - 32usize];
};
pub type lwpid_t = uint_t;
unsafe extern "C" {
    pub fn _lwp_kill(arg1: lwpid_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _lwp_info(arg1: *mut lwpinfo) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _lwp_self() -> lwpid_t;
}
unsafe extern "C" {
    pub fn _lwp_suspend(arg1: lwpid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _lwp_continue(arg1: lwpid_t) -> ::std::os::raw::c_int;
}
pub type ctevid_t = u64;
pub const ctstate_CTS_OWNED: ctstate = 0;
pub const ctstate_CTS_INHERITED: ctstate = 1;
pub const ctstate_CTS_ORPHAN: ctstate = 2;
pub const ctstate_CTS_DEAD: ctstate = 3;
pub type ctstate = ::std::os::raw::c_uint;
pub use self::ctstate as ctstate_t;
pub const ct_typeid_CTT_PROCESS: ct_typeid = 0;
pub const ct_typeid_CTT_DEVICE: ct_typeid = 1;
pub const ct_typeid_CTT_MAXTYPE: ct_typeid = 2;
pub type ct_typeid = ::std::os::raw::c_uint;
pub use self::ct_typeid as ct_typeid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ct_event {
    pub ctev_id: ctid_t,
    pub ctev_pad1: u32,
    pub ctev_evid: ctevid_t,
    pub ctev_cttype: ct_typeid_t,
    pub ctev_flags: u32,
    pub ctev_type: u32,
    pub ctev_nbytes: u32,
    pub ctev_goffset: u32,
    pub ctev_pad2: u32,
    pub ctev_buffer: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ct_event"][::std::mem::size_of::<ct_event>() - 48usize];
    ["Alignment of ct_event"][::std::mem::align_of::<ct_event>() - 8usize];
    ["Offset of field: ct_event::ctev_id"][::std::mem::offset_of!(ct_event, ctev_id) - 0usize];
    ["Offset of field: ct_event::ctev_pad1"][::std::mem::offset_of!(ct_event, ctev_pad1) - 4usize];
    ["Offset of field: ct_event::ctev_evid"][::std::mem::offset_of!(ct_event, ctev_evid) - 8usize];
    ["Offset of field: ct_event::ctev_cttype"]
